{"url":"http://www.ratan.blog/lightyear","id":"http://www.ratan.blog/lightyear","title":"Lightyear Was Fine","date_modified":"2022-06-19T03:51:04-04:00","date_published":"2022-06-19T01:18:28-04:00","content_html":"<p>Pixar&rsquo;s <em>Lightyear</em> was fine. I&rsquo;d even call it good - but not great. I had a couple thoughts about this movie, although frankly it was straightforward so there probably isn&rsquo;t much to say. There will be spoilers in this article.</p>\n\n<h2>Isn&rsquo;t it a Bit Late?</h2>\n\n<p><img src=\"/lightyear/attachments/tv_show.webp\" alt=\"Buzz Lightyear characters from the TV Show\" /></p>\n\n<p><em>Toy Story</em> was released in 27 years ago and <em>Toy Story 2</em> was 23 years ago. There was a Buzz Lightyear spin-off show and direct-to-video movie 22 years ago (which I had blissfully forgotten about). Even <em>Toy Story 3</em> is 12 years old, and one of the plot points of that movie was that a kid from the time of <em>Toy Story</em> would be old enough to go to college.</p>\n\n<p>Feel old yet? I suspect a lot of the interest in <em>Lightyear</em> is based on the nostalgia of people in their twenties and thirties. Do kids actually care about Buzz Lightyear? On the way to the cinema I overheard a kid tell his dad he would be interested in the new <em>Minions</em> movie - and that&rsquo;s another franchise which is getting long in the tooth.</p>\n\n<p>I guess kids might know Buzz from <em>Toy Story 4</em>.</p>\n\n<p>The point is, Hollywood is milking old franchises as much as they can. And by going to see <em>Lightyear</em> I helped, in a tiny way, to support this banal behaviour. Pixar has made films that aren&rsquo;t sequels but because I am no longer in Pixar&rsquo;s target audience I didn&rsquo;t see any of them. Yet I am still afflicted with the disease of nostalgia, the weakness of familiarity, the almost Pavlovian impulse to stare at a screen if it shows me something I enjoyed once upon a time.</p>\n\n<p>Sorry, this is an article about a movie, right?</p>\n\n<h2>Advertisements and Trailers</h2>\n\n<p>The trailer for <a href=\"https://en.wikipedia.org/wiki/Marcel_the_Shell_with_Shoes_On_(2021_film)\"><em>Marcel the Shell with Shoes On</em></a> was cute. After seeing <em>Everything, Everywhere, All at Once</em> I am a bit more interested in A24&rsquo;s material.</p>\n\n<h2>The Turnip People</h2>\n\n<p><img src=\"/lightyear/attachments/turnip.webp\" alt=\"The &quot;turnip&quot;\" /></p>\n\n<p><em>Lightyear</em> has a plot with 3 distinct segments: an introduction, a video game mini-plot, and a finale.</p>\n\n<p>One early part of the introduction that stood out was how well organized the marooned Star Command crew were. Within a year they apparently set up a colony that not only provided the necessities of life but had an entire spaceport and the materials to make hyperspace fuel. They probably had a lot of building material in their &ldquo;turnip&rdquo; ship: as we find out later the crew also set up a mine on a distant part of the planet.</p>\n\n<p>The flora and fauna of this planet are really boring. This is especially noticeable if you watch <em>Lightyear</em> after a trailer for James Cameron&rsquo;s next <em>Avatar</em> movie. It&rsquo;s not a big deal, most of the plot is technology-focused anyway, yet I still wish the alien life were more interesting.</p>\n\n<p>We do not know much details about the crew&rsquo;s society. Is everyone&rsquo;s lives governed by an authoritarian adherence to Star Command protocol - or is that just how they treat Buzz Lightyear and their expensive aerospace material? Buzz&rsquo;s goal to eventually find a way to leave the planet could be a danger to the colony&rsquo;s regime, which is one possible reason Buzz&rsquo;s mission was canceled.</p>\n\n<p>Another possibility is that the crew actually have a more democratic society but they are collectively tired of spending resources on a hopeless mission. As later parts of the film point out, everyone has a life on the planet except Buzz - so the hyperspace program primarily benefits Buzz. None of that explains why they have to decommission Sox, Buzz&rsquo;s sentient robot cat. It is also an odd coincidence that Buzz&rsquo;s hyperspace tests are the same length as an American presidential term.</p>\n\n<p>Why did the writers decide there needed to be so many test flights of 4 years each, instead of one or two longer trips? The obvious answer is to establish Buzz Lightyear&rsquo;s stubborn and slightly arrogant character, and contrast it with Alisha Hawthorne who actually has a life. The writers also probably wanted the successful test flight to feel more significant and emotional given by making it particularly long.</p>\n\n<p>I mentioned Buzz Lightyear as being stubborn and arrogant, but he is also very sincere - not an annoying wisecrack like some of the male leads of the <em>Star Wars</em> sequels. Even when he goes rogue, Buzz still acts like a member of an organization who broke a rule or two, rather than a lifelong criminal not bound by any standards. He even mentions the authority of his rank in some scenes.</p>\n\n<h2>Collect the Capacitors</h2>\n\n<p><img src=\"/lightyear/attachments/crew.webp\" alt=\"Buzz, Izzy and friends\" /></p>\n\n<p>It is after Buzz steals a ship and does his successful hyperspace test that the video game mini-plot begins. It starts interesting with the twenty-year jump, and the introduction of Izzy Hawthorne, her friends, and Zurg. However it devolves into a fetch quest pretty quickly. The main characters must:</p>\n\n<ul>\n<li>go to a spaceport&hellip;</li>\n<li>to fly a ship&hellip;</li>\n<li>to destroy Zurg&rsquo;s ship&hellip;</li>\n<li>to allow the crew to turn off the laser shield&hellip;</li>\n<li>so that Buzz can return to the crew and finish his mission</li>\n</ul>\n\n\n<p>And to top it all off, they fry a circuit during their spaceflight and must obtain a capacitor from a mining facility.</p>\n\n<p>Yes, a capacitor.</p>\n\n<p>It is during this period that Buzz&rsquo;s character develops - from being an arrogant loner to a person willing to accept help and be a team player. One memorable line from this portion of the story:</p>\n\n<blockquote><p>We don&rsquo;t need you to save us. We need you to join us.</p></blockquote>\n\n<p>There is also a scene where everybody eats sandwiches with the toppings on the outside and the bread on the inside. This sandwich arrangement is the most shocking twist in the entire film (sorry Zurg). So are these sandwiches just for fun or do they have a deeper meaning? Buzz eventually eats one and enjoys it, showing his increased willingness to change his ways. They could also symbolize exposing one&rsquo;s juicy vulnerability, instead of hiding it behind a dry, firm exterior. Yet it is not as though the bread is omitted entirely, because Lightyear and Hawthorne still need a firm core.</p>\n\n<p>The more concerning thing about the sandwiches is the expiry date. If the <del>Starfleet</del> Star Command colony has been trapped for a week, are those sandwiches safe to eat?</p>\n\n<h2>Zurg</h2>\n\n<p><img src=\"/lightyear/attachments/zurg.jpg\" alt=\"Zurg\" /></p>\n\n<p>In the finale we finally learn Zurg&rsquo;s backstory. It&rsquo;s not <em>that</em> surprising  but I will omit some important details, as a bit of a self-imposed puzzle.</p>\n\n<p>Zurg intends to use Buzz Lightyear&rsquo;s hyperspace fuel to travel back in time, for reasons explained quite well in the film. As a side effect the century-old marooned Star Command colony would cease to exist.</p>\n\n<p>But would it really? Clearly time travel in this film is not a closed time loop: Zurg&rsquo;s actions changed the past. He even says he &ldquo;broke time&rdquo;. So did Zurg&rsquo;s time travel involve merely leaving his original timeline? Or did he <em>destroy</em> his original timeline? Given Buzz and Zurg&rsquo;s attitudes towards Zurg&rsquo;s plan, it&rsquo;s fair to say that altering time destroys timelines within the logic of this film. It&rsquo;s no wonder that Zurg has so little regard for human life: the entire timeline is doomed anyway.</p>\n\n<p>When Zurg reveals his identity, Buzz trusts him almost instantly. This is a bit hard to believe. Zurg&rsquo;s robots attacked the Star Command colony and nearly killed Izzy Hawthorne and friends. Did Buzz just forget all of that? Honestly he probably did: Zurg&rsquo;s reveal <em>would</em> be pretty surprising without the context of fiction. Luckily the cooperation does not last long.</p>\n\n<p>Zurg is a foil to Buzz even before the reveal. The scene where Zurg gets fed up with his robots and chases Buzz down solo is a mirror of Buzz&rsquo;s own annoyance with autopilot. That said the robots do not pester Zurg the way rookies would pester Buzz: they appear only at Zurg&rsquo;s command, can get back to Zurg&rsquo;s ship at the press of a button, and only say &ldquo;Zurg&rdquo;.</p>\n\n<p>According to Izzy Hawthorne, Zurg appeared only a week before Buzz finished his final hyperspace test. He could obviously obtain the hyperspace fuel from Buzz, but why did he attack the Star Command colony? Was it to obtain their hyperspace fuel mixing machines? Or perhaps purely to manipulate Buzz?</p>\n\n<p>Another nice scene during the finale was Izzy Hawthorne getting over her fear of space - this was mentioned earlier but could have used a bit more build up.</p>\n\n<h2>Conclusion</h2>\n\n<p><em>Lightyear</em> felt short, simple and straightforward. The visuals were good, especially the spaceships. Buzz and Izzy were alright characters with alright character arcs. <em>Lightyear</em> might technically be the simplest time travel story ever - mainly because so little time travel actually occurs.</p>\n\n<p>It was good, but not great. Pixar cut out almost all unnecessary detail. Yet I wonder if they cut too much. The characters other than Buzz could have been fleshed out more. The plot could have had less MacGuffin chasing and more human drama. Did I mention there was a capacitor in this movie?</p>\n\n<p>I would not want a sequel unless Hawthorne was the main character. Although the Lightyear name pulled me towards this film, I think we got enough of him.</p>","attachments":[{"url":"http://www.ratan.blog/lightyear/attachments/crew.webp","mime_type":"image/webp"},{"url":"http://www.ratan.blog/lightyear/attachments/turnip.webp","mime_type":"image/webp"},{"url":"http://www.ratan.blog/lightyear/attachments/tv_show.webp","mime_type":"image/webp"},{"url":"http://www.ratan.blog/lightyear/attachments/zurg.jpg","mime_type":"image/jpeg"}],"tags":["movies"],"_ratan_blog_class":""}
