{"url":"http://www.ratan.blog/j-choices","id":"http://www.ratan.blog/j-choices","title":"Choices","date_modified":"2023-01-25T21:32:16-05:00","date_published":"2023-01-25T21:32:16-05:00","content_html":"<p><img src=\"/j-choices/attachments/thumbnail.svg\" alt=\"Memo Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>The jet black ink of the exam paper said:</p>\n\n<blockquote><p>What is the voltage VGS3 between the gate and source of MOSFET M3 below?</p></blockquote>\n\n<p>It was a multiple choice question, and all the options looked wrong. In fact, all the options looked identical, except for the position of the decimal point.</p>\n\n<p><em>This has got to be some kind of trick question,</em> I thought.</p>\n\n<p>I flipped to the exam&rsquo;s formula sheet but forgot how any of them actually applied to the question. I flipped back to the task at hand, and looked at the corresponding diagram.</p>\n\n<p>The diagram was a sprawling maze of MOSFETs. Damn MOSFETs! What ever happened to all the good old resistors? V = IR, that was simple, memorable, a true classic. But the MOSFET, the physical foundation of the digital age, was governed by principles beyond my comprehension.</p>\n\n<p><em>Fuck it, I&rsquo;ll get back this one later</em> I thought, with no intention of actually returning. <em>Next question, next question.</em></p>\n\n<blockquote><p>What is the current IB5 flowing through the BJT B5 below?</p></blockquote>\n\n<p>&ldquo;No,&rdquo; I whispered. The student to the left of me shot me a brief look. <em>Another</em> bipolar junction transistor question where I had to calculate the current through the middle terminal, which was the absolute worst. At least the MOSFETs didn&rsquo;t have currents in their middle terminals. And at least MOSFETs were actually used in real life, why was my professor so obsessed with BJTs? This isn&rsquo;t 1975, I&rsquo;m not building the Cray-1, so why on God&rsquo;s silicon-rich Earth was I losing my mind staring at an image of a BJT?</p>\n\n<p>I looked around the exam room in despair. Everyone was rushing. Turning pages, drawing diagrams, pressing the buttons on their calculator. They all knew what they were doing, or at least looked like it.</p>\n\n<p>But me? I was lost. I stared at the sharpened tip of my pencil, anything to keep my mind off the MOSFETs and BJTs and amplifiers.</p>\n\n<p>The pencil was sharp.</p>\n\n<p>Good for drawing a thin line on a diagram.</p>\n\n<p>But perhaps more than that.</p>\n\n<p>The pencil was pointing directly towards my eye. I stared at the graphite point.</p>\n\n<p>Could it slice through the jelly of my eye? My blood vessels? My nerves and my brain?</p>\n\n<p><em>Stop, stop this. Focus, focus, focus,</em> I thought.</p>\n\n<p>I stared at the clock. A clock with an actual face and hands. How ironic: in this temple of modernity, the acolytes of the digital priesthood had to stare into the face of an analog clock.</p>\n\n<p><em>Wait, no, that clock, it cannot be right,</em> I thought. If that clock were right, I&rsquo;d only have 30 minutes left. And I was still in the multiple-choice portion, the appetizer of this feast of pain.</p>\n\n<p>And then I saw him. That guy, the one who always sat in the front of the class and answered all the most tedious questions. He was walking up to the front with his exam paper in hand. He smiled at the exam proctor, picked up his bag and left.</p>\n\n<p>I clenched my fists and bared my teeth. <em>How did he do it? HOW DID HE DO IT?</em> I thought. But it didn&rsquo;t matter anymore. It was hopeless.</p>\n\n<p>I flipped through every page of the exam paper and randomly sprinkled equations upon them. Would the TAs be merciful in their judgement? Would the arcane formulae ward off their red pens and zeros? No, this was just a final fit of desperation. These were pleadings of forgotten exes, these were the whimpers of wounded animals, these were the cries of dying men. If I had acted differently months ago, things might have turned out differently. But now, my present was the prisoner of my past. Now, my choices were as empty as the current through a MOSFET&rsquo;s middle terminal.</p>\n\n<p>I would never be a computer engineer.</p>\n\n<h2><span id=\"Feedback from the Joy of Writing Group\">Feedback from the Joy of Writing Group</span></h2>\n\n<ul>\n<li>&ldquo;until next year, right?&rdquo;</li>\n<li>really captured the feeling of being a student</li>\n<li>could work for contest?\n\n<ul>\n<li>aim at the toronto star reader</li>\n<li>2500 words</li>\n</ul>\n</li>\n<li>nice clock</li>\n<li>indulgent when subject was distracted</li>\n</ul>","attachments":[{"url":"http://www.ratan.blog/j-choices/attachments/thumbnail.svg","mime_type":"image/svg+xml"}],"tags":["joy of writing","creative"],"_ratan_blog_class":"swit "}
