{"url":"http://www.ratan.blog/adding-comments","id":"http://www.ratan.blog/adding-comments","title":"Adding Comments","date_modified":"2023-01-02T01:45:01-05:00","date_published":"2018-09-06T20:00:32-04:00","content_html":"<p>As part of my recent <a href=\"/blog-enhancements\">blog-enhancement attempt</a> I\nadded a comment system!</p>\n\n<h3><span id=\"Writing And Editing Your Comment\">Writing And Editing Your Comment</span></h3>\n\n<p>There are no accounts, logins or passwords on this site. There are also not any comment/reply notifications (yet?).</p>\n\n<p>The comment form accepts text in the <a href=\"https://daringfireball.net/projects/markdown\">Markdown</a> format, with a lot of limitations. If you do not know Markdown and do not\nfeeling like learning it today, a plain text comment will probably\nwork just fine.</p>\n\n<p>Your website, if provided, will be shared with other readers. Your email will not be shared, however: only I will see it. If there&rsquo;s\na comment-related issue, I might contact you through that email.</p>\n\n<p>After you press “Submit” a cookie is stored on your browser which\nidentifies you to the comment system, and expires in 15 minutes. You\ncan only edit or delete your comment while this cookie is active. This\nmeans:</p>\n\n<ul>\n<li><strong>You have at most 15 minutes to delete/edit a comment.</strong></li>\n<li>If you clear your cookies, you cannot delete/edit comments you wrote before the clear.</li>\n<li>If you switch browsers or machines, you cannot delete/edit comments you wrote on your current browser/machine.</li>\n</ul>\n\n\n<p>After the timeout is over, if you still need to clarify your comment,\nyou will just have to reply to your own comment.</p>\n\n<p>This is admittedly all a bit inconvenient, but the plus side is that\nunlike on social media, your identity can be hidden from the wider\nworld. Even I will only have your IP Address (and anything you type\nin, of course).</p>\n\n<h3><span id=\"Moderation\">Moderation</span></h3>\n\n<p>The policy is less &ldquo;my site, my rules&rdquo; and more like &ldquo;my site, my\nwhims&rdquo;. I can remove your comment at any time, for any reason.</p>\n\n<p>I will not edit your comment, except to change the text to &ldquo;REMOVED\nFOR [reason]&rdquo;. Or perhaps I will delete your comment without a trace.</p>\n\n<h3><span id=\"Technical Details\">Technical Details</span></h3>\n\n<p>This site uses <a href=\"https://posativ.org/isso/\">Isso</a>, with a lot of custom\nstyling. Some of the limitations in the comment system are inherent to\nIsso, while others are just caused by my configuration.</p>\n\n<p>Why Isso? Well&hellip;</p>\n\n<ul>\n<li>It&rsquo;s free.</li>\n<li>It doesn&rsquo;t deploy adverts or tracking scripts.</li>\n<li>It&rsquo;s open-source (not a purely ideological concern: there&rsquo;s a good chance I might actually want to edit the code someday).</li>\n<li>I host it on my site, rather than having to trust someone else&rsquo;s server.</li>\n<li>It doesn&rsquo;t require accounts, passwords or anything of the sort.</li>\n<li>It has existed for a long time, but is still being updated.</li>\n<li>It&rsquo;s customizable.</li>\n</ul>\n\n\n<p>Isso apparently doesn&rsquo;t scale well, so I may need to switch to another\nsystem if ratan.blog gains a few million visitors. Until then, I hope\nyou enjoy commenting.</p>","attachments":[],"tags":["meta","technology"],"_ratan_blog_class":""}
