{"url":"http://www.ratan.blog/j-misremembered","id":"http://www.ratan.blog/j-misremembered","title":"Misremembered","date_modified":"2023-01-19T09:36:14-05:00","date_published":"2023-01-19T09:36:14-05:00","content_html":"<p><img src=\"/j-misremembered/attachments/thumbnail.svg\" alt=\"Confused Face Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>I will get to work on time. Yes, I will.</p>\n\n<p>I will not sleep through my alarm.</p>\n\n<p>I will not be seduced by the siren&rsquo;s song of the showerhead, nor the warmth of the bathwater. Yes, I will shower. No, I will not shower for more than 5 minutes, I will jump out when my alarm, my personal banshee, tells me to.</p>\n\n<p>I will not have a complete breakfast. I will eat some dry cereal, which is considered merely part of a complete breakfast in every advertisement. No, I will not daydream about whether that is a legal requirement constraining the manufacturer.</p>\n\n<p>I will not forget my keys and wallet. I will detect them with ease, using an AirTag if the process takes more than 30 seconds. It won&rsquo;t take more than 30 seconds, though. It will be trivial.</p>\n\n<p>I will not overspeed on residential roads. The local limit is 30 kilometers per hour and I will stick to it, even if it momentarily seems like it will lead to my being late.</p>\n\n<p>I will not repeat what happened in Moncton.</p>\n\n<p>I will not-</p>\n\n<p>I will not-</p>\n\n<p>I will not think about Moncton at all. Moncton is my past, my future will be right here.</p>\n\n<p>I will rise beyond the past, I will show them all, all those people who didn&rsquo;t care about me, all of them who doubted me, I will prove them wrong. Yes, one day they will open their social media feeds and see that it was I who became powerful, and they who remained mundane and boring and weak.</p>\n\n<p>No wait. On second thoughts.</p>\n\n<p>I will not be so vulnerable to delusions of grandeur.</p>\n\n<p>I will park in the easternmost parking lot, and walk to the entrance furthest from the Tim Horton&rsquo;s so that I don&rsquo;t have to talk to Joshua about Moncton. I will place my keycard on the scanner and -</p>\n\n<p>No wait. It&rsquo;s Sunday.</p>","attachments":[{"url":"http://www.ratan.blog/j-misremembered/attachments/thumbnail.svg","mime_type":"image/svg+xml"}],"tags":["creative","joy of writing"],"_ratan_blog_class":"swit "}
