{"url":"http://www.ratan.blog/windows-era","id":"http://www.ratan.blog/windows-era","title":"Life With Windows","date_modified":"2023-01-02T01:45:01-05:00","date_published":"2021-05-08T11:00:05-04:00","content_html":"<p><img src=\"/windows-era/attachments/windows.svg\" alt=\"Windows logo\" /></p>\n\n<p>I used Windows uncomfortably often during the last year, much more than in the prior ten. It turns out, a lot of my expectations were obsolete. Windows has changed in many tiny ways over the past decade, but still finds ways to frustrate and confound.</p>\n\n<h3><span id=\"Windows Subsystem For Linux (WSL\">Windows Subsystem For Linux (WSL)</span>)</h3>\n\n<p>According to <a href=\"https://docs.microsoft.com/en-us/windows/wsl/\">Microsoft itself</a>:</p>\n\n<blockquote><p>The Windows Subsystem for Linux lets developers run a GNU/Linux environment &ndash; including most command-line tools, utilities, and applications &ndash; directly on Windows, unmodified, without the overhead of a traditional virtual machine or dual-boot setup.</p></blockquote>\n\n<p>In my months of experience, I found this statement to be mostly accurate. Obviously there isn&rsquo;t much hardware access, but there is at least file system and network access. A lot of my gripes with WSL are being actively worked on.</p>\n\n<p>There are some interesting subtleties, even in Microsoft&rsquo;s official statement. Consider the word &ldquo;developers&rdquo;. WSL isn&rsquo;t meant for most Windows &ldquo;users&rdquo;, it is meant for &ldquo;developers&rdquo; to either work on Linux applications or use a Linux toolchain to cross-compile a Windows app. Creating an application that needs WSL on a user&rsquo;s machine is probably a hack.</p>\n\n<p>There is only one Windows app I have used that literally requires WSL: a recent version of Docker. Docker&rsquo;s entire purpose is running Linux containers, so it is sensible for them to avoid duplicating WSL&rsquo;s functionality. Not so sensible for other applications, however.</p>\n\n<p>Microsoft also decided to refer to the Linux userspace as &ldquo;GNU/Linux&rdquo;, which is a bit odd considering that <a href=\"https://www.reddit.com/r/gnu/comments/bqszff/is_alpine_gnulinux/\">Alpine Linux</a> is one of the <a href=\"https://www.microsoft.com/en-us/p/alpine-wsl/9p804crf0395?activetab=pivot:overviewtab\">officially supported options</a>. However, if you&rsquo;re using WSL because the Windows Command Prompt is missing features you want, then Alpine is an annoyingly minimalist choice. I ended up using Ubuntu WSL more often than Alpine WSL.</p>\n\n<p>WSL doesn&rsquo;t just enable &ldquo;GNU/Linux&rdquo; applications to run on Windows. It also allows applications in your Windows PATH to run in WSL. <a href=\"https://www.howtogeek.com/426749/how-to-access-your-linux-wsl-files-in-windows-10/\">For example you can type <code>explorer.exe .</code> to run Windows Explorer from inside WSL.</a> Of course not all Windows applications were designed to be run this way.</p>\n\n<h3><span id=\"Changing the Windows PATH\">Changing the Windows PATH</span></h3>\n\n<p><img src=\"/windows-era/attachments/path.jpg\" alt=\"Windows interface for changing PATH\" /></p>\n\n<p>The interface for changing the Windows PATH is actually really nifty. I wish more Unix-based systems had a similar window. However the obvious problem is that there isn&rsquo;t just one PATH, is there? Each shell and application might be making alterations its PATH while it is running, even on Windows.</p>\n\n<p>Also, the only people who even care about the PATH are command-line users, who should be okay with reading and writing text files anyway. Or should they? Sometimes I wonder if these sorts of assumptions are holding back the possible capabilities of our software.</p>\n\n<h3><span id=\"Shells, Consoles, Terminals\">Shells, Consoles, Terminals</span></h3>\n\n<p><img src=\"/windows-era/attachments/shell.jpg\" alt=\"Windows Terminal with 13 shells\" /></p>\n\n<p>If you use command-lines often, you likely understand that a modern command-line involves a number of applications working together. Details such as font size and color combinations are controlled seperately from details such as how the computer responds to <code>echo Hello</code>.</p>\n\n<p>Most articles on this topic use the terms &ldquo;shell&rdquo;, &ldquo;console&rdquo; and &ldquo;terminal&rdquo;. To quote <a href=\"https://superuser.com/a/144668\">this answer on SuperUser</a>:</p>\n\n<blockquote><p>The <strong>shell</strong> is the program which actually processes commands and returns output. Most shells also manage foreground and background processes, command history and command line editing&hellip;</p>\n\n<p>A <strong>terminal</strong> refers to a wrapper program which runs a shell. Decades ago, this was a physical device consisting of little more than a monitor and keyboard. As unix/linux systems added better multiprocessing and windowing systems, this terminal concept was abstracted into software.</p></blockquote>\n\n<p>Typical shells on a Linux system include <code>bash</code>, <code>zsh</code>, <code>fish</code> and <code>ash</code>. Typical terminals include Gnome Terminal, <code>xterm</code>, and <code>urxvt</code>.</p>\n\n<p>So what is the shell/terminal situation on Windows like?</p>\n\n<p>The default shell is of course the <a href=\"https://en.wikipedia.org/wiki/Cmd.exe\">Command Prompt</a>. Like many Microsoft products, it is designed to be compatible with ancient software that someone, somewhere cannot bear to abandon. Apart from being available on all Windows computers since the dawn of the NT kernel, I cannot think of a redeeming quality of Command Prompt compared to alternatives.</p>\n\n<p>There is also the much more interesting <a href=\"https://en.wikipedia.org/wiki/PowerShell\">Powershell</a>. Unlike typical Unix shells where every command inputs and outputs text, in PowerShell every command inputs and outputs an object. This is pretty cool, but there are several caveats.</p>\n\n<p>For one thing, PowerShell is entirely different from typical Unix shells. This in itself is problem for a lot of people. Interestingly, Microsoft has ported &ldquo;PowerShell Core&rdquo; to non-Windows systems. Perhaps PowerShell could become someone&rsquo;s default Unix shell someday.</p>\n\n<p>That would be deeply ironic because on Windows, PowerShell cannot execute scripts by default. Scripting must be explicitly enabled by the user. <a href=\"https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_execution_policies?view=powershell-7.1\">This is an entirely intentional feature.</a> Unfortunately this means as an application developer, you cannot rely on PowerShell always being available on a user&rsquo;s Windows computer.</p>\n\n<p>There are also &ldquo;Developer Command Prompts&rdquo; available with Visual Studio: one for every combination of target and tool CPU architecture. No, I&rsquo;m serious, check out <a href=\"https://docs.microsoft.com/en-us/cpp/build/building-on-the-command-line?view=msvc-160\">this page</a> which lists the following:</p>\n\n<blockquote><ul>\n<li>Developer Command Prompt - Sets the environment to use 32-bit, x86-native tools to build 32-bit, x86-native code.</li>\n<li>x86 Native Tools Command Prompt - Sets the environment to use 32-bit, x86-native tools to build 32-bit, x86-native code.</li>\n<li>x64 Native Tools Command Prompt - Sets the environment to use 64-bit, x64-native tools to build 64-bit, x64-native code.</li>\n<li>x86_x64 Cross Tools Command Prompt - Sets the environment to use 32-bit, x86-native tools to build 64-bit, x64-native code.</li>\n<li>x64_x86 Cross Tools Command Prompt - Sets the environment to use 64-bit, x64-native tools to build 32-bit, x86-native code.</li>\n</ul>\n</blockquote>\n\n<p>And to add insult to injury, all five of those are based on Command Prompt instead of PowerShell. The Developer PowerShell is <a href=\"https://docs.microsoft.com/en-us/visualstudio/ide/reference/command-prompt-powershell?view=vs-2019\">seperate</a>.</p>\n\n<p>Other shells are available from third parties. For example, Git is typically installed with <a href=\"https://gitforwindows.org/\">Git Bash</a>, bringing the Unix <code>bash</code> shell to Windows. <a href=\"https://www.msys2.org/\">MSYS2</a> really changed the game by bringing the Unix <code>bash</code> shell to Windows. But <a href=\"https://cygwin.com/index.html\">Cygwin</a> also still exists, providing the ability to run <code>bash</code> on Windows.</p>\n\n<p>Oh, and of course WSL instances allow &ldquo;developers&rdquo; to run <code>bash</code> on Windows.</p>\n\n<p>The situation with terminals on Windows also strange. <a href=\"https://en.wikipedia.org/wiki/Windows_Console\">Windows Console</a> is the default terminal for Command Prompt, PowerShell and numerous other applications. Luckily, I didn&rsquo;t have to use it long enough to hate it.</p>\n\n<p>The newer <a href=\"https://en.wikipedia.org/wiki/Windows_Terminal\">Windows Terminal</a> adds a lot of missing features, but with a twist: there isn&rsquo;t a graphical settings dialog. <a href=\"https://garrytrinder.github.io/2020/12/my-wsl2-windows-terminal-setup\">Windows Terminal is currently configured by editing a JSON file</a>, which isn&rsquo;t terrible in and of itself.</p>\n\n<p>Also, Windows Terminal isn&rsquo;t shipped with Windows, but provided as a download from the Microsoft Store. By contrast, the Windows Console will continue shipping for <a href=\"https://devblogs.microsoft.com/commandline/introducing-windows-terminal/\">&ldquo;decades to come&rdquo;</a>. This means that much like PowerShell, application developers cannot rely on Windows Terminal existing on a user&rsquo;s machine. So of course they are all still defaulting to using Windows Console.</p>\n\n<p>The end result is that if <em>I</em> want to use Windows Terminal for all my shells, <em>I</em> must edit the Windows Terminal JSON whenever I install a new shell that isn&rsquo;t &ldquo;blessed&rdquo; by the Terminal team, such as Git Bash and the Visual Studio shell prompts&hellip;</p>\n\n<p>This is frankly a bit ridiculous. Can&rsquo;t all the teams at Microsoft get together and agree on <em>one</em> shell in <em>one</em> terminal with all the necessary features?</p>\n\n<h3><span id=\"Ports of Unix Favourites\">Ports of Unix Favourites</span></h3>\n\n<p>Let&rsquo;s say you want to play <a href=\"https://nethack.org/\"><em>NetHack</em></a> on a <a href=\"https://alt.org/nethack/\">public server</a> using SSH, but your home computer runs Windows.</p>\n\n<p>Conventional knowledge might lead you to install <a href=\"https://www.chiark.greenend.org.uk/~sgtatham/putty/\">PuTTY</a>. Or perhaps since you&rsquo;ve kept up with all the latest development trends, you could opt to use SSH inside of WSL instead.</p>\n\n<p>Or&hellip; you could just type <code>ssh nethack@alt.org</code> into the default Command Prompt just like on Linux.</p>\n\n<p><img src=\"/windows-era/attachments/ssh.jpg\" alt=\"SSH in Command Prompt\" /></p>\n\n<p>Yes, that&rsquo;s right. You can even copy your <code>.ssh</code> folder directly from Linux and plop it in your Windows user folder, because <a href=\"https://www.howtogeek.com/336775/how-to-enable-and-use-windows-10s-built-in-ssh-commands/\">since about 2018, Microsoft has been bundling OpenSSH with Windows 10</a>.</p>\n\n<p>They also started <a href=\"https://techcommunity.microsoft.com/t5/containers/tar-and-curl-come-to-windows/ba-p/382409\">bundling <code>tar</code> and <code>curl</code></a>. This is a major convenience: before Microsoft started bundling <code>curl</code>, you might have needed to download files using <a href=\"https://docs.microsoft.com/en-us/windows/win32/bits/background-intelligent-transfer-service-portal\">this strange thing</a>, or at least its various PowerShell wrappers. As for <code>tar</code>, opening its file format used to require third-party tools like 7-Zip.</p>\n\n<p>Is there any more Unix software being discreetly bundled into recent releases of Windows? I could trawl through Microsoft&rsquo;s entire development blog, actually read the release notes of every Windows update and &hellip; on second thoughts I&rsquo;ll just search for tools when I need them.</p>\n\n<h3><span id=\"WinGet Package Manager\">WinGet Package Manager</span></h3>\n\n<p>Microsoft is finally making a package manager for Windows, known as <code>winget</code>. <a href=\"https://beebom.com/how-uninstall-apps-using-winget-windows-package-manager/\">Uninstalling a package is still an experimental feature</a>.</p>\n\n<p>For a home user who isn&rsquo;t installing applications on a hundred Windows machines, I don&rsquo;t think <code>winget</code> (or other Windows package managers such as <a href=\"https://chocolatey.org/\">Chocolately</a>) are as useful as their Unix equivalents. In most cases Windows applications do not depend on other Windows applications, and are bundled with all their libraries.</p>\n\n<p>Of course the situation is different when considering developer-focused package managers like <a href=\"https://www.nuget.org/\"><code>nuget</code></a>, since developers do need to keep track of dependencies in their projects.</p>\n\n<p>Also, if Windows Terminal, WSL, <code>ssh</code>, <code>curl</code> and the like were all being managed by <code>winget</code>, then <code>winget</code> could treat those as dependencies for some larger utility program.</p>\n\n<h3><span id=\"Reset Your PC\">Reset Your PC</span></h3>\n\n<p>It&rsquo;s pretty easy to reset or reinstall Windows these days, which is great if there are a lot of useless files and programs to be removed. However there is a catch: all software bundled with the PC is reinstalled.</p>\n\n<p>Yes, <a href=\"https://support.microsoft.com/en-us/windows/how-to-refresh-reset-or-restore-your-pc-51391d9a-eb0a-84a7-69e4-c2c1fbceb8dd\">both the &ldquo;Refresh your PC&rdquo; and &ldquo;Reset your PC&rdquo; options keeps the apps that came with the PC</a>. Did your PC come with the Netflix Windows app, random games, and pointless OEM shovelware preinstalled? Say hello to them again!</p>\n\n<p>That said this is still a convenient feature. If you have a backup ready to go, you can return your PC to factory settings with ease.</p>\n\n<h3><span id=\"Backing Up\">Backing Up</span></h3>\n\n<p><a href=\"https://superuser.com/questions/998785/windows-10-difference-between-file-history-and-backup-and-restore\">Oh of course Windows supplies two seperate backup utilities.</a></p>\n\n<p><a href=\"https://superuser.com/questions/1133653/\">Neither of which are all that great.</a></p>\n\n<p>Honestly I haven&rsquo;t been keeping many backups, for reasons independent of software. The external hard disk that I would normally use for backups was extremely unreliable. It would just disconnect at the slightest disturbance. I had to basically cradle the hard disk like a baby for it to actually maintain a connection to the computer. Recently I got an external SSD which will hopefully be more convenient at this critical task.</p>\n\n<h3><span id=\"Microsoft PowerToys\">Microsoft PowerToys</span></h3>\n\n<p>One of the features of Linux I was missing was the ability to install a <a href=\"https://en.wikipedia.org/wiki/Tiling_window_manager\">tiling window manager</a> such as <code>xmonad</code>, <code>i3</code> or perhaps <code>sway</code>. The search for a Windows alternative is what led me to the <a href=\"https://docs.microsoft.com/en-us/windows/powertoys/\">PowerToys</a> utilties in general, and <a href=\"https://docs.microsoft.com/en-us/windows/powertoys/fancyzones\">FancyZones</a> in particular.</p>\n\n<p>However, by default FancyZones doesn&rsquo;t force new windows into zones like a tiling window manager would. Instead the user must drag a window into a zone. It&rsquo;s easy to fall out of the habit. FancyZones also has a bit of trouble with applications running in Administrator mode.</p>\n\n<p>There was another PowerToy that I found pretty handy: the <a href=\"https://docs.microsoft.com/en-us/windows/powertoys/powerrename\">PowerRename</a> utility. In a recent biology course, I didn&rsquo;t like the video filenames the professor chose, and PowerRename helped me rename them in bulk. On Linux, of course, there is the <a href=\"https://man7.org/linux/man-pages/man1/rename.1.html\"><code>rename</code> command</a> which provides all the same features, minus the graphical interface.</p>\n\n<p>There are many other PowerToys that I never ended up using.</p>\n\n<h3><span id=\"Leaving Microsoft Windows\">Leaving Microsoft Windows</span></h3>\n\n<p><img src=\"/windows-era/attachments/i3_screenshot.jpg\" alt=\"Screenshot of Manjaro with i3\" /></p>\n\n<p>It was the lack of a tiling window manager that really tempted me away from Windows. Moving around applications individually is a nuisance. Switching back to Linux during the middle of a school term seemed like a bad idea, so I bided my time.</p>\n\n<p>However even on Linux, tiling window managers aren&rsquo;t <em>that</em> popular. I eventually chose the <a href=\"https://www.manjaro.org/downloads/community/i3/\"><code>i3</code> community edition of Manjaro Linux</a>. But of course, that was a &ldquo;community&rdquo; edition, lacking &ldquo;official&rdquo; support. Eventually when <a href=\"https://wiki.archlinux.org/title/wayland\">Wayland and pals</a> are finally ready to dethrone X11, I might need to switch from <code>i3</code> to <code>sway</code>, which is of course even more obscure.</p>\n\n<p>Before installing Manjaro, I reinstalled Windows and kept a tiny partition for it, just in case.</p>\n\n<h3><span id=\"Conclusions?\">Conclusions?</span></h3>\n\n<p>So is there an actual point to this list of links and gripes?</p>\n\n<p>Clearly Microsoft is incrementally moving towards making their system more attractive to develop on. It is becoming possible to develop a Linux userland application on Windows without any third-party tools at all. People who primarily use desktop Linux to develop web or server applications might be tempted to just use Windows.</p>\n\n<p>There are still plenty of reasons to use desktop Linux. The most industry-relevant reason is to develop a Linux application that directly communicates with hardware.</p>\n\n<p>Desktop Linux also provides the freedom to customize your Linux kernel and install alternative user interfaces (like tiling window managers). It allows you to really customize every tiny detail of your system, but that freedom is not really important or even accessible for most people. Is being able to edit the source code of Linux <code>rename</code> <em>that</em> compelling compared to actually knowing what you&rsquo;re doing with Microsoft PowerRename?</p>\n\n<p>I can only hope that these moves by Microsoft encourage more creativity and innovation in Linux&rsquo;s graphical interfaces. Creating (more?) replicas of the Windows user interface would be a really poor way for desktop Linux to compete with WSL.</p>\n\n<p>Inter-team confusion continues to impede Microsoft&rsquo;s progress. Did the Developer Command Prompt people even know that Microsoft Terminal was being developed? <a href=\"https://devblogs.microsoft.com/commandline/sharing-ssh-keys-between-windows-and-wsl-2/\">Did the WSL team ever meet the people bundling <code>ssh</code> into Windows?</a> Will the PowerToys team ever be able to <em>really</em> change the Windows interface with a future version of FancyZones?</p>\n\n<p>I suppose that from now on, I&rsquo;ll be keeping a closer eye on Windows, even if I avoid using it at home.</p>","attachments":[{"url":"http://www.ratan.blog/windows-era/attachments/i3_screenshot.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/windows-era/attachments/i3_screenshot.png","mime_type":"image/png"},{"url":"http://www.ratan.blog/windows-era/attachments/path.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/windows-era/attachments/path.png","mime_type":"image/png"},{"url":"http://www.ratan.blog/windows-era/attachments/shell.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/windows-era/attachments/shell.png","mime_type":"image/png"},{"url":"http://www.ratan.blog/windows-era/attachments/ssh.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/windows-era/attachments/ssh.png","mime_type":"image/png"},{"url":"http://www.ratan.blog/windows-era/attachments/windows.svg","mime_type":"image/svg+xml"}],"tags":["technology"],"_ratan_blog_class":""}
