{"url":"http://www.ratan.blog/endgame","id":"http://www.ratan.blog/endgame","title":"Endgame Without Infinity War","date_modified":"2023-01-02T01:45:01-05:00","date_published":"2019-05-11T19:30:07-05:00","content_html":"<p><em>This article includes spoilers for Avengers: Endgame. Don&rsquo;t scroll too fast!</em></p>\n\n<p>I watched <em>Avengers: Endgame</em> three days back, despite having missed out on most of the recent Marvel movies. It was still mostly enjoyable and understandable.</p>\n\n<h3><span id=\"Pregame\">Pregame</span></h3>\n\n<p><img src=\"/endgame/attachments/pregame-small.png\" alt=\"MCU character timeline\" /></p>\n\n<p>The timeline above, which I found <a href=\"https://www.reddit.com/r/marvelstudios/comments/8hwil7/mcu_character_timeline/\">here</a>, shows <em>almost</em> all the movies that build up to <em>Endgame</em>. <em>Captian Marvel</em>, released after <em>Infinity War</em>, is also pretty important. I was not a Marvel completionist, but I still saw a fair number of these. Over the past <em>eleven</em> years of the MCU, I saw:</p>\n\n<ul>\n<li>All of <a href=\"https://en.wikipedia.org/wiki/List_of_Marvel_Cinematic_Universe_films#Phase_One\">Phase One</a> except <em>The Incredible Hulk</em></li>\n<li>All of <a href=\"https://en.wikipedia.org/wiki/List_of_Marvel_Cinematic_Universe_films#Phase_Two\">Phase Two</a> except <em>Ant-Man</em></li>\n<li><em>Spider-Man Homecoming</em>, which I apparently <a href=\"/spiderman-homecoming\">enjoyed</a></li>\n</ul>\n\n\n<p>There were several strong entries in Phase Three which I missed, largely out of a sense of snobbishness. I wasn&rsquo;t too happy with <em>Age of Ultron</em>. Additionally, my family is generally more interested in film than I am: now that I don&rsquo;t live with them I see fewer films in general.</p>\n\n<p>Despite missing out on the bulk of Phase Three, I still heard quite a lot about it. At some of my prior workplaces I have been in long conversations about the MCU in general, and <em>Infinity War</em> in particular. I mean, I was working with a guy who had an Infinity Gauntlet style wristwatch, with itty-bitty Infinity Stones on the edge of the clockface. There was another guy I worked with who had all the Funko Pop Avengers, as well as a few Funko Pop DC superheroes and Funko Pop X-Men. Most of the websites I frequent are rife with references to these movies. I have watched and read reviews of the individual films, as well as commentary on the state of superhero movies in general. In short, the hype has been reaching a fever pitch.</p>\n\n<p>It seems like the events of <em>Endgame</em> are going to be very important for <em>Spider-Man: Far From Home</em>, which I actually plan to see at some point. Tom Holland actually issued an <em>Endgame</em> spoiler warning at the start of one of the <em>Far From Home</em> trailers: it just goes to show how quickly all these films are being released. <em>Captain Marvel</em> was still in theatres: Marvel is really churning out superhero movies like sausages. I decided to delay watching the most spoiler-heavy <em>Far From Home</em> trailer because I was unsure about whether or not I would see <em>Endgame</em>.</p>\n\n<p><img src=\"/endgame/attachments/win-small.jpg\" alt=\"I see this as an absolute win!\" /></p>\n\n<p>During <em>Endgame</em>&rsquo;s opening week, spoiler warnings sprouted all over the internet like some sort of digitally transmitted fungus. However the warnings have recently started to recede, and the first <em>Endgame</em> <a href=\"https://knowyourmeme.com/memes/i-see-this-as-an-absolute-win\">memes</a> have started to proliferate. I needed to know the truth once and for all: would Ant-Man <em>really</em> crawl up Thanos' digestive tract? This is one of the reasons I finally caved in and decided to give <em>Endgame</em> a look.</p>\n\n<p>The other reason is that I had fond memories of <em>Iron Man</em> and the first <em>Avengers</em> film. I had not kept track of all the characters' journeys but I did want to know if, and how, they might meet their end.</p>\n\n<h3><span id=\"The Part Where the Avengers Avenge Something\">The Part Where the Avengers Avenge Something</span></h3>\n\n<p><img src=\"/endgame/attachments/nasa-small.jpg\" alt=\"NASA's suggestion to save Tony Stark\" /></p>\n\n<p>The film started really strong, except for having Captain Marvel ferry Tony Stark back to Earth. It seemed like a waste to put Tony Stark in the deep darkness of space, only to return him to Earth in the first two minutes. I had no idea how he ended up there, having not seen <em>Infinity War</em>, but it seemed like something more dramatic was going to happen. On the other hand, it could have been <a href=\"https://twitter.com/NASA/status/1071818572056403970\">cornier</a>.</p>\n\n<p>I guess in retrospect, having the film <em>start</em> with Stark accepting his death is a bit of foreshadowing. There&rsquo;s another moment that stuck out as suspicious even without retrospect: a comment Steve Rogers made in his support group. He said something along the lines of &ldquo;if we can&rsquo;t move on, Thanos should have killed all of us.&rdquo; I suppose great beefcakes think alike?</p>\n\n<p>Speaking of Thanos, the encounter with him near the beginning went in a really unexpected direction. It says a lot about Thanos, not to mention about the hollowness of &ldquo;avenging&rdquo;.</p>\n\n<p>As someone who did not actually watch <em>Infinity War</em>, I still found these early scenes of characters dealing with the &ldquo;Snapture&rdquo; very moving. I did not necessarily care about Ant-Man as an individual, but following him around the depopulated Earth was something of a gloomy spectacle.</p>\n\n<p>Tony Stark having a family was another really engaging change. Compare the way he treats the random kid who helps him in <em>Iron Man 3</em> to the way he tucks his daughter in to bed at night. Not to mention how a genius playboy billionaire philanthropist ended up married and living in a cottage in the woods. What a turn-around.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=9tKr3m6r9NI\">I&rsquo;m a sucker for intentional awkwardness.</a></p>\n\n<p>By the way, the screening I went to did not include the grayscale footage of the bulk of the cast turning to dust. The scene of Hawkeye&rsquo;s family disappearing made the point well enough.</p>\n\n<h3><span id=\"The Part Where Everyone Parties Like It's 2012\">The Part Where Everyone Parties Like It&rsquo;s 2012</span></h3>\n\n<p><img src=\"/endgame/attachments/timeline-small.png\" alt=\"Timeline Diagram\" /></p>\n\n<p>I wasn&rsquo;t paying attention when the time travel rules were being explained. All I remember is the characters bringing up other time travel movies and claiming that they don&rsquo;t make sense. In <em>Back to the Future 2</em> they had the decency of giving Doc Brown a chalkboard, but <em>Endgame</em> only provides shots of Bruce Banner talking. I only realized that alternate timelines were being made after leaving the cinema. The diagram above, which I found <a href=\"https://www.reddit.com/r/MarvelStudiosSpoilers/comments/bhkdbm/my_comprehensive_ae_time_travel_plot_diagram/\">here</a> shows the full complexity of what was going on.</p>\n\n<p>Regarding alternate-timeline-based time travel, it does seem a bit ignoble to mess up somebody else&rsquo;s reality for the sake of your own. One of the <em>Doctor Strange</em> side-characters (whose name I never knew) brought this up. Universe-branching also means that there are lower stakes than if there was a need to maintain a stable time loop. Of course, if time loops were involved then Tony Stark would have not agreed to the mission in the first place.</p>\n\n<p>Ultimately I only really thought about any of this after the movie was over. When I was actually in the cinema, I sometimes wondered about the timeline being preserved but for the most part just enjoyed all the shenanigans. It was good fun for the most part. The scene where &ldquo;Howard Potts&rdquo; met Howard Stark melted my cold, icy heart.</p>\n\n<p>There were a couple of &ldquo;time heist&rdquo; scenes I disliked. It really seems like Nebula should have seen her fate coming, and I didn&rsquo;t care much about Black Widow and Hawkeye&rsquo;s reverse gladiator fight. I had no idea why Red Skull was involved, I&rsquo;m sure the answer was mentioned in <em>Infinity War</em>. I had a vague idea who Hank Pym was from a Wikipedia article I read a couple of years ago, but I had no clue what Pym particles were.</p>\n\n<p>Bit of a pet peeve of mine, but <em>how come the film uses the Gregorian calendar in outer space?</em></p>\n\n<h3><span id=\"The Part With Fighting and Stuff\">The Part With Fighting and Stuff</span></h3>\n\n<p><img src=\"/endgame/attachments/lego-small.jpg\" alt=\"Avengers LEGO\" /></p>\n\n<p>Some reviewers didn&rsquo;t like how Past-Thanos was brought to the future. However, even when sitting in the theatre chair I knew that there was no telling how much preparation was involved. Past-Thanos and Past-Nebula could have had a multi-year time travel research team. It didn&rsquo;t worry me at all, really. Since I hadn&rsquo;t seen <em>Infinity War</em> I also wasn&rsquo;t too worried about Past-Thanos not really having a history fighting on Earth.</p>\n\n<p>The massive final fight scene bored me a little though. It&rsquo;s a great spectacle, sure: pretty much every named MCU protagonist versus an army of &hellip; robot-aliens devoid of personality. Frankly I was never too fond of these fight scenes with hordes of enemies. It seems especially silly given that the only truly important parts of the battlefield are the location of the Infinity Gauntlet and the location of Captain Marvel.</p>\n\n<p>There is a scene where various women from the MCU are guarding Captian Marvel, and I personally asked myself if Captain Marvel actually needed help. She tore a spaceship apart upon her arrival, and can travel the galaxy at faster-than-light speeds without a vehicle or even a helmet. The robot-alien hordes were too numerous, I suppose.</p>\n\n<p>I was bored enough to start thinking about my life beyond the film during this fight. I know, these massive fights are a genre convention, and I expected nothing less from the final installment in this twenty-something long saga. However I would have preferred more time heists. At least until the final moments of the fight.</p>\n\n<p>Tony Stark&rsquo;s end was actually tragic. The man was the central pillar of this entire franchise, a household name for the entire past decade. It&rsquo;s hard to imagine an MCU without him. Even as a casual with only a limited exposure to Phase Three, I felt something of a connection to the guy. I quite enjoyed <em>Iron Man</em> back in the day. It&rsquo;s incredible how far Stark has come.</p>\n\n<p>Steve Rogers' conclusion made me feel a little fuzzy inside. I was never as sentimentally attached to Steve as to Tony. Also I didn&rsquo;t care at all about the Falcon or passing on the shield. Still it&rsquo;s great that he actually got to retire. In retrospect, it&rsquo;s also neat that his super-serum didn&rsquo;t cause problems in his old age.</p>\n\n<p>Thor&rsquo;s conclusion is cool and all but what about Bruce Banner? I suppose that since he was sort of at peace right at the start of the film there was no reason to elaborate further at the end.</p>\n\n<h3><span id=\"The Bigger Picture\">The Bigger Picture</span></h3>\n\n<p><em>Endgame</em> was good. I&rsquo;m glad I saw it. Even without seeing <em>Infinity War</em>, it still mostly worked. I wouldn&rsquo;t call it incredible or amazing.</p>\n\n<p>This really seems like peak MCU. Or perhaps <em>Infinity War</em> was peak MCU. In either case while Marvel still plans on making more films, they can&rsquo;t realistically top the past two years of hype without <em>another</em> couple of years of preparation.</p>\n\n<p>Future MCU films will probably also depend on the strength of characters introduced in Phase Three. I don&rsquo;t really know about any of them, except for Spider-Man. Hopefully someone cares about Nebula, Scarlet Witch, the Falcon, Valkyrie and &ldquo;the chick with the antennae&rdquo;. As far as villainous plots go, it&rsquo;s hard to top eliminating half the universe&rsquo;s population. Additionally, now that the MCU includes time travel, the characters of future installments will have access to multiple universes' worth of resources.</p>\n\n<p>So far other studios haven&rsquo;t replicated Marvel&rsquo;s success with shared universes. Honestly, I&rsquo;m not sure I have the patience for <em>more</em> shared universes of this scope. Also, if DC doesn&rsquo;t get its act together and other companies don&rsquo;t make an entirely original universe, I wonder what the source material for other shared universes will be. Tolkien&rsquo;s <em>Silmarillion</em>? Asimov&rsquo;s <em>Foundation</em>? The fall of the Roman Republic? Actually instead of any of that we&rsquo;ll be seeing a lot more <a href=\"https://www.vanityfair.com/hollywood/2016/04/james-cameron-avatar-sequels?verso=true\">aliens who look like blue humans</a>.</p>","attachments":[{"url":"http://www.ratan.blog/endgame/attachments/lego.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/endgame/attachments/lego-small.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/endgame/attachments/nasa.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/endgame/attachments/nasa-small.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/endgame/attachments/pregame.png","mime_type":"image/png"},{"url":"http://www.ratan.blog/endgame/attachments/pregame-small.png","mime_type":"image/png"},{"url":"http://www.ratan.blog/endgame/attachments/timeline.png","mime_type":"image/png"},{"url":"http://www.ratan.blog/endgame/attachments/timeline-small.png","mime_type":"image/png"},{"url":"http://www.ratan.blog/endgame/attachments/win.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/endgame/attachments/win-small.jpg","mime_type":"image/jpeg"}],"tags":[],"_ratan_blog_class":""}
