{"url":"http://www.ratan.blog/j-mutual-defiance","id":"http://www.ratan.blog/j-mutual-defiance","title":"Mutual Defiance","date_modified":"2022-12-31T05:00:13-05:00","date_published":"2022-12-06T04:53:34-05:00","content_html":"<p>&ldquo;So how does the scoring work in this game again?&rdquo; asked Lucy, on my left. &ldquo;One point each time you play the highest card?&rdquo;</p>\n\n<p>&ldquo;Highest of the suit,&rdquo; said James, on my right. &ldquo;But if you don&rsquo;t correctly predict the points you&rsquo;ll get in a trick, you lose points.&rdquo;</p>\n\n<p>&ldquo;I for one predict total loss,&rdquo; I said sarcastically while looking at my hand. After all, the four of clubs was not high value at all.</p>\n\n<p>James predicted one win, Lucy predicted total loss, Karthik predicted two wins, and Lisa predicted three wins. Then the trick of <em>Wizard</em> commenced.</p>\n\n<p>When James started with his ace of spades, I responded with my five of spades. &ldquo;Oh no, I correctly predicted that I&rsquo;m a total loser,&rdquo; I said, as James carefully collected the cards that earned him a point.</p>\n\n<p>Karthik played two Wizards in a row: his prediction of two wins came true. With so few Wizards left, Lisa was able to sweep through three rounds with her aces and kings.</p>\n\n<p>We each had only one card left. Lisa&rsquo;s was the two of clubs. James and Karthik played cards that weren&rsquo;t clubs and were thus, useless. But Lucy&rsquo;s card was probably a club, since she hadn&rsquo;t any card of any other suit during the entire trick. No wonder she predicted total loss.</p>\n\n<p>&ldquo;I guess I lost this one,&rdquo; I said in mock despair. &ldquo;Woe is me.&rdquo; I played my four of clubs and waited for Lucy to play the Queen or ten or whatever else.</p>\n\n<p>&ldquo;Not if I lose this hand first,&rdquo; said Lucy defiantly, as she placed the three of clubs on the table.</p>\n\n<p>I slapped my forehead and said, &ldquo;Seriously?&rdquo;</p>\n\n<p>I won the hand and lost the trick. I won the battle and lost the war.</p>\n\n<h2>Notes</h2>\n\n<p>This was written in 15 minutes during a Joy of Writing meetup.</p>","attachments":[],"tags":["creative","joy of writing"],"_ratan_blog_class":""}
