{"url":"http://www.ratan.blog/wonder-woman","id":"http://www.ratan.blog/wonder-woman","title":"Thoughts on Wonder Woman","date_modified":"2022-01-24T01:43:58-05:00","date_published":"2017-07-04T15:11:46-04:00","content_html":"<p>So I joined my uncles, aunts and cousins when they went to see <em>Wonder Woman</em>.</p>\n\n<p>Speculation walking in</p>\n\n<ul>\n<li>Will this be any good? DC&rsquo;s recent track record made me pessimistic.  Some of my friends said this was good&hellip; but they were also OK with <em>Suicide Squad</em>.</li>\n</ul>\n\n\n<p>The pre-movie</p>\n\n<ul>\n<li>Trailers for <em>Atomic Blonde</em> and a <em>Blade Runner</em> remake were intriguing.</li>\n<li>Is it <em>Avatar 2: the Return</em>? No, it is Luc Besson&rsquo;s newest creation, <em>Valerian and The City of a Thousand Planets</em>. I was uninterested until I noticed Luc Besson&rsquo;s name on a poster.</li>\n<li><em>Justice League</em> is already being advertised. At long last, I got to see the new, buff Aquaman in motion.</li>\n</ul>\n\n\n<p>The actual movie</p>\n\n<ul>\n<li>One of my cousins thought the flashback would end quickly and there would be a story in the present. <em>Nope</em></li>\n<li>It&rsquo;s <em>beautifullllllllll</em>.</li>\n<li>Diana was born to fight.</li>\n<li>Will Diana jump off that cliff? Yes, but &hellip;</li>\n<li>The eeriness of an all-female island wears off quickly. Once it was pointed out that there was only one child on the whole island things got a bit more disturbing IMO. Some of these Amazons are clearly older than others but &hellip; none are children.</li>\n<li>I guess sometime in this movie, we&rsquo;ll find out if the Greek Gods are canon in the DC Cinematic Universe. Question is, are the DC Greek Gods canon in the original mythology?</li>\n<li>&ldquo;War will never be fair!&rdquo; &hellip; or something along those lines.</li>\n<li>Will Diana jump off that cliff? Yes, but &hellip;</li>\n<li>It&rsquo;s not <em>beautifullllllllll</em>.</li>\n<li>Is our male lead of this movie going to be a German pilot, in the service of Kaiser Wilhelm II&rsquo;s attempt to escape the encirclement of hostile foreign powers? That&rsquo;d be a pretty interesting turn &hellip; <em>Nope</em></li>\n<li>Amazons vs. WWI Germans: very suspenseful. I&rsquo;m glad neither side was totally curb-stomped.</li>\n<li>There a lot of things that must be very carefully spelled out in old-timey English.</li>\n<li>Hey look, it&rsquo;s <a href=\"https://en.wikipedia.org/wiki/Erich_Ludendorff\">Ludendorff</a>, an actual historical figure. Nice touch.</li>\n<li>Also nice to see that the Ottoman Empire&rsquo;s existence and role in WWI is acknowledged&hellip; I guess?</li>\n<li>Diana is <em>not</em> an Amazon? OK.</li>\n<li>&ldquo;You let that little thing tell you what to do?&rdquo; Since that era, we&rsquo;ve leveled up to letting server farms tell us what to do.</li>\n<li>Will Diana jump off that cliff? Yes, but it&rsquo;s a long jump.</li>\n<li>I was very closely watching the boat in the background during the heartfelt goodbye scene, waiting &hellip; wondering &hellip;</li>\n<li>There was no way we&rsquo;d get through a movie featuring an all-woman civilization without a funny but awkward convo about marriage, relationships and &hellip; sleeping together. So it&rsquo;s a good thing we got that out of the way early.</li>\n<li>London is horrible.</li>\n<li>&ldquo;Ohhh a baby!&rdquo; I find it easy to forget that Diana comes from a society without children.</li>\n<li>A whole movie starring the secretary would be enjoyable. OK, maybe a series of short films.</li>\n<li>Lots of fun, but innocent scenes here. Exactly the sort of thing <em>Suicide Squad</em> didn&rsquo;t have.</li>\n<li>The patriarchal and command-chain-obsessed British military is something of an annoyance for Diana.</li>\n<li>Hey Ludendorff might be vile, but should he really be a cartoon villain? He&rsquo;s an actual historical figure after all.</li>\n<li>The attitude that soldiers were born to die offends Amazons as much as modern society.</li>\n<li>Very fitting, having a rope to compel people to tell the truth while travelling with a spy.</li>\n<li>What a saavy old man.</li>\n<li>War is hell.</li>\n<li>Token Native American is here. Also a sad Scot. And Sameer.</li>\n<li>&ldquo;May we get what we want.&rdquo; &ldquo;And may we get what we need.&rdquo; &ldquo;But may we never get what we deserve.&rdquo;</li>\n<li>Diana is naive, and incapable of seeing the big picture, but is powerful enough to survive nonetheless.</li>\n<li>Diana is a one-woman demolition crew. And can throw tanks.</li>\n<li>Photo time!</li>\n<li>Token Native American believes in Greek Gods. Well&hellip; given the events of the past few days, why not, right?</li>\n<li>Some of these Ludendorff scenes are entertaining (and grisly), but I could not bring myself to ignore the fact that there was an actual German military leader named Ludendorff.</li>\n<li>Sameer is funny, even when he&rsquo;s pretending to be a servant to a cruel colonial master.</li>\n<li>Hard to seduce someone when you keep glancing at your side chick.</li>\n<li>Dancing with the figurative and/or literal God of War?</li>\n<li>The chase begins.</li>\n<li>&ldquo;What&rsquo;s that?&rdquo; &ldquo;The future.&rdquo;</li>\n<li>There&rsquo;s a pretty exciting fight. A fight <em>to the death</em>.</li>\n<li>This is a poignant ending for this arc. Unusual for a superhero movie. Maybe Diana will mow down a whole army at this point?</li>\n<li>WHAT?</li>\n<li>Oh well, still a good ending.</li>\n</ul>\n\n\n<p>Parting thoughts</p>\n\n<ul>\n<li>Pretty solid movie. Misses some chances to be unconventional.</li>\n<li>I really liked the humor, simple though it was.</li>\n<li>Also enjoyed the various settings in this movie. Much more interesting than the drab prisons and urban sprawl of <em>Suicide Squad</em>.</li>\n<li>Always appreciate the &ldquo;War is Hell&rdquo; message.</li>\n<li>Look, Ludendorff was awful in real life, but this is just silly. This is like seeing a Robot Hitler or a Mutant Stalin who randomly kills subordinates.</li>\n<li>I think chopping off one of the final scenes would make for a better movie. I prefer gods which act in mysterious ways, as opposed to leading a blatant (non)existence. However these scenes are not bad.</li>\n<li>One of my cousins pointed out: <em>that</em> mustache does not fit <em>that</em> helmet. You&rsquo;ll know the ones.</li>\n</ul>","attachments":[],"tags":["movies"],"_ratan_blog_class":""}
