{"url":"http://www.ratan.blog/j-revolution","id":"http://www.ratan.blog/j-revolution","title":"Revolution","date_modified":"2023-01-19T09:32:51-05:00","date_published":"2023-01-19T09:32:51-05:00","content_html":"<p><img src=\"/j-revolution/attachments/thumbnail.svg\" alt=\"Cyclone Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>&ldquo;That beyblade looks a bit unusual,&rdquo; Isaac said.</p>\n\n<p>Isaac was using the term &ldquo;beyblade&rdquo; for simplicity: the spinning top his cousin John was holding was not official merchandise. It was some kind of knockoff, some kind of fake. For one thing it didn&rsquo;t have the word &ldquo;beyblade&rdquo; anywhere on the box. But more importantly there were four massive metal blades sticking out of the toy, each larger than the upper surface of the spinning top.</p>\n\n<p>&ldquo;But it looks so cool, let&rsquo;s try it,&rdquo; said Luke, Isaac&rsquo;s younger brother.</p>\n\n<p>&ldquo;Yeah I&rsquo;m curious how it looks when it spins,&rdquo; said John.</p>\n\n<p>&ldquo;Okay well <em>I&rsquo;m</em> not using it and I&rsquo;m not risking my Dragoon-Draciel hybrid against it either,&rdquo; Isaac said. The current generation beyblades were very customizable, players could swap out parts from different beyblades. Luke found the parts-swapping a fun way to spend his time. John enjoyed experimenting with the different combinations, learning the trade-offs of speed and stability. Isaac, who was getting a bit old for all this, considered the customization a clever way to sell lots of toys to kids. But although Isaac was getting old for beyblade, he wasn&rsquo;t sure if he was old enough to be supervising both Luke and John while their parents were shopping. As the younger brother, Luke was a known factor. As a cousin from another town, John was a bit less familiar, and a lot less deferential.</p>\n\n<p>&ldquo;Speaking of hybrid blades, I wonder if this one is compatible with the official parts,&rdquo; John said as he inserted the faux-beyblade into a launcher.</p>\n\n<p>&ldquo;What if I put Dranzer&rsquo;s weight disk on it?&rdquo; asked Luke.</p>\n\n<p>&ldquo;What if this doesn&rsquo;t spin at all and was a total rip-off?&rdquo; asked Isaac.</p>\n\n<p>John tightly gripped the launcher and cord, and looked down sternly at a bowl-shaped stadium large enough to serve fish curry to ten people. Then, just like the characters in the official anime, he shouted &ldquo;3-2-1 let it rip!&rdquo;</p>\n\n<p>The off-brand toy spun out of its launcher and fell into the center of the bowl. It seemed as stable as any official beyblade. The enormous blades spun fast enough to look like a translucent silver shield, spitting in the face of gravity itself.</p>\n\n<p>&ldquo;It works!&rdquo; said John with a smile. &ldquo;Let&rsquo;s see it in battle against the other beyblades.&rdquo;</p>\n\n<p>&ldquo;Not with mine,&rdquo; said Isaac, grabbing his Dragoon-Draciel hybrid before anyone else did.</p>\n\n<p>&ldquo;Let me try, let me try!&rdquo; said Luke. He grabbed his Dranzer, fixed it to his launcher, and pulled the cord while yelling &ldquo;3-2-1 let it rip!&rdquo;</p>\n\n<p>The agile Dranzer fell into the edge of the bowl, and raced to the center where its competition patiently spun waiting. Dranzer hit the un-named blade&rsquo;s massive scythes, and was sent careening out of the stadium, onto the floor. The entire competition was over in a second, and the false beyblade, the usurper to the spinning top throne, revolved just the same. It was not a battle, it was a slaughter.</p>\n\n<p>&ldquo;Hey something is wrong with Dranzer,&rdquo; said Luke.</p>\n\n<p>Isaac and John examined the fallen combatant. The topmost plastic ring was no longer symmetrical.</p>\n\n<p>&ldquo;It looks like the attack ring was damaged, a bit of it broke off,&rdquo; said Isaac.</p>\n\n<p>&ldquo;That&rsquo;s incredible power,&rdquo; said John.</p>\n\n<p>&ldquo;But now we&rsquo;re going to have to get a new beyblade,&rdquo; said Isaac.</p>\n\n<p>&ldquo;We have a new beyblade right here,&rdquo; said John, gesturing to the unofficial blade in the stadium.</p>\n\n<p>&ldquo;It&rsquo;s still spinning!&rdquo; said Luke. &ldquo;That&rsquo;s amazing!&rdquo;</p>\n\n<p>&ldquo;You know what would be an interesting experiment,&rdquo; said John. &ldquo;We could keep getting the new beyblade to battle our old beyblades until it finally stops.&rdquo;</p>\n\n<p>&ldquo;That would be cool, let&rsquo;s do it!&rdquo; said Luke.</p>\n\n<p>Isaac gripped his Dragoon-Draciel hybrid tightly. Luke was too young to think about how all these beyblades cost money, or what their parents would think about them intentionally wrecking their toys. <em>But surely John should know better, right?</em> thought Isaac.</p>\n\n<p>&ldquo;I don&rsquo;t think we should have these continuous battles,&rdquo; said Isaac. &ldquo;It&rsquo;s cool to watch the new blade spin. But it&rsquo;s not fair to use it in battle. It&rsquo;s not even a real beyblade, it&rsquo;s a fake. It&rsquo;s like using a Pokemon card you wrote yourself.&rdquo;</p>\n\n<p>&ldquo;Are you <em>chicken</em>?&rdquo; asked Luke.</p>\n\n<p>&ldquo;No,&rdquo; said Isaac.</p>\n\n<p>&ldquo;Well whenever we do a beyblade battle you always use your hybrid blade and never let me use it,&rdquo; said Luke. &ldquo;But now you don&rsquo;t want to use it. Because you&rsquo;re <em>scared</em>.&rdquo;</p>\n\n<p>&ldquo;Yeah you&rsquo;re totally <em>scared</em>,&rdquo; said John.</p>\n\n<p>Isaac narrowed his eyes at briefly looked at John. <em>You always got to do this, don&rsquo;t you? Always got to pull me into things,</em> thought Isaac.</p>\n\n<p>&ldquo;Fine, fine, let&rsquo;s try it,&rdquo; said Isaac. He put his hybrid blade in his launcher, and looked at the wheel of destruction in the stadium below.</p>\n\n<p><em>If my beyblade approaches from the side, it&rsquo;s toast,</em> thought Isaac. <em>But what if it flies in from the top? What if my blade never touches the bowl at all?</em></p>\n\n<p><em>That sounds suspiciously like cheating,</em> thought Isaac.</p>\n\n<p><em>This entire thing is a cheat,</em> thought Isaac.</p>\n\n<p>He positioned his launcher unusually high. Then he sighed, rolled his eyes, and pulled the cord as hard as he could.</p>\n\n<p>&ldquo;3-2-1 let it rip,&rdquo; Isaac said.</p>\n\n<p>Isaac&rsquo;s beyblade began its spinning descent at a different height and angle than the others. The official beyblade hit its illegitimate competitor at about 30 degrees from the horizontal, without touching any of the gargantuan metal claws.</p>\n\n<p><em>I can&rsquo;t believe I actually aimed right,</em> thought Isaac as the two spinning tops bounced away from each other. The knock-off spinning top spun slower and slid right up the edge of the bowl. The massive spinning knives sliced through Luke&rsquo;s delicate skin.</p>\n\n<p>Luke screamed in horror as he bled. &ldquo;It hurt me! Help! Help!&rdquo; he yelled.</p>\n\n<p>Isaac and John looked at Luke, and then at each other.</p>\n\n<p>&ldquo;How about we never do that again?&rdquo; said John.</p>\n\n<p>&ldquo;How about we get some antiseptic?&rdquo; said Isaac.</p>\n\n<h3><span id=\"Notes\">Notes</span></h3>\n\n<p>This was initially titled &ldquo;Battle&rdquo;.</p>\n\n<h3><span id=\"Feedback from The Joy of Writing group\">Feedback from The Joy of Writing group</span></h3>\n\n<ul>\n<li>fun</li>\n<li>nice dialogue</li>\n<li>describe the blades on the unofficial beyblade\n\n<ul>\n<li>are they as big as kitchen knives?</li>\n</ul>\n</li>\n</ul>","attachments":[{"url":"http://www.ratan.blog/j-revolution/attachments/thumbnail.svg","mime_type":"image/svg+xml"}],"tags":["creative","joy of writing"],"_ratan_blog_class":"swit "}
