{"url":"http://www.ratan.blog/j-executed","id":"http://www.ratan.blog/j-executed","title":"Executed","date_modified":"2023-01-02T22:47:25-05:00","date_published":"2022-11-22T04:45:02-05:00","content_html":"<p><img src=\"/j-executed/attachments/thumbnail.svg\" alt=\"Cooked rice Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>&ldquo;Rice and yogurt,&rdquo; I told the warden.</p>\n\n<p>&ldquo;You sure? We could get you anything, really. At least anything within the budget. A steak perhaps. A curry from one of the local places. Some grilled pork belly?&rdquo; the warden responded.</p>\n\n<p>&ldquo;No. I lived by principle and now shall die by it. Rice and yogurt,&rdquo; I said. &ldquo;There should be slightly more yogurt than rice. And it should be solid yogurt, not mere fluid curds.&rdquo;</p>\n\n<p>The warden nodded. &ldquo;I suppose it&rsquo;s too late to ask you to change your ways, Great Prophet,&rdquo; he said.</p>\n\n<p>&ldquo;Do not mock me with a title you do not believe,&rdquo; I told the warden. I felt bad being harsh to the warden, for he had at times been kindly. But only kindly by the standards of a prison for death row inmates.</p>\n\n<p>The guards escorted me to my cell for the last time. We passed the cells of many others, waiting to die. Some were murderers and even rapists, and were waiting decades to die. But not I. My words were too dangerous to last even a month.</p>\n\n<p>The guards closed my cell door, leaving me alone with my bed. But I did not dare sleep. I savoured every last moment, even in this dismal room. Every tally mark scratched into the wall, every suspicious stain on the floor, every bit of rust on the bedframe.</p>\n\n<p>As the night drew on, my eyes grew weary and my mind became infected by temptation. It was sloth, the most insidious of the deadly sins. &ldquo;Just a little nap,&rdquo; Sloth said. &ldquo;You&rsquo;ll feel better tomorrow.&rdquo;</p>\n\n<p>But tomorrow was the day of my last meal. I would only feel executed.</p>\n\n<h3><span id=\"Notes\">Notes</span></h3>\n\n<p>This was written in 15 minutes during a Joy of Writing meetup.</p>","attachments":[{"url":"http://www.ratan.blog/j-executed/attachments/thumbnail.svg","mime_type":"image/svg+xml"}],"tags":["creative","joy of writing"],"_ratan_blog_class":"swit "}
