{"url":"http://www.ratan.blog/goodbye-facebook","id":"http://www.ratan.blog/goodbye-facebook","title":"Goodbye Facebook","date_modified":"2023-01-02T23:06:48-05:00","date_published":"2018-01-26T15:11:46-04:00","content_html":"<p><em>What follows is an adaption of my final Facebook post to a form that suits this blog.</em></p>\n\n<p>I recently deleted my Facebook account, and will no longer use commerical products made by Facebook. I did not do this purely for humanitarian reasons, nor purely for selfish reasons.</p>\n\n<p>Facebook has achieved quite a lot of power in society in exchange for a rather poor product. There are a lot of extremely powerful companies and poor products in the world but Facebook takes the cake on both dimensions.</p>\n\n<h3><span id=\"The Product\">The Product</span></h3>\n\n<p>The News Feed is terrible, because it optimizes for engagement, not happiness. Back when I used it, it would often aggravating to read because that&rsquo;s how you make money advertising. It is also not optimizing for meaning, nuance, truth or good style. All must be sacrificed for engagement.</p>\n\n<p>As a writing medium, it is much less expressive than normal HTML.</p>\n\n<p>Messenger is fine, but not at all special technologically. The only reason these services are used so widely is that &ldquo;everyone&rdquo; uses them.</p>\n\n<h3><span id=\"The Power\">The Power</span></h3>\n\n<p>Facebook is using its social graph, control over the News Feed and its users personal information in destructive ways.</p>\n\n<ul>\n<li>Censorship of posts according <a href=\"https://www.propublica.org/article/facebook-hate-speech-censorship-internal-documents-algorithms\">to their own internal standards</a>, independent of any law or user&rsquo;s wishes. It is within Facebook&rsquo;s rights: their platform is their property. But considering how many people get their news from Facebook it is harmful.</li>\n<li>Attempting to pass off the <a href=\"https://gizmodo.com/former-facebook-workers-we-routinely-suppressed-conser-1775461006\">very subjective choices of its staff</a> as a neutral, popularity-based &ldquo;Trending News&rdquo; section.</li>\n<li>Ranking non-censored posts according to an opaque algorithm in the News Feed. Is it good? Is it bad? Actually, everyone&rsquo;s feed is different and the algorithm is secret so good luck evaluating it in any way. I hear a lot of podcasters and the like complain about their posts remaining unseen by fans.</li>\n<li>Taking all the advertising revenue from <a href=\"http://www.slate.com/articles/technology/technology/2015/07/freebooting_stolen_youtube_videos_going_viral_on_facebook.html\">pirated videos</a>.</li>\n<li>Attempting to <a href=\"https://www.theverge.com/2017/7/27/16050446/facebook-net-neutrality-digital-colonialism-internet-org\">control the internet in third world countries</a>, to the benefit of their partners, under the guise of being helpful.</li>\n</ul>\n\n\n<p>A lot of these issues are less about the strict action and more about the message behind them. How obvious is it that companies are paying to be in your &ldquo;News Feed&rdquo;? Or that human staffers are trying to out-hip Twitter in your &ldquo;Trending News&rdquo;? Or that <a href=\"https://info.internet.org\">&ldquo;internet.org&rdquo;</a> is not some humanitarian mission but a massive market grab?</p>\n\n<h3><span id=\"Conclusion\">Conclusion</span></h3>\n\n<p>There is another major tech giant amassing personal information and gaining power over what people think. Ending my use of their products will be difficult: their services are rather good and have permeated my life. <a href=\"https://www.networkworld.com/article/2940176/opensource-subnet/kicking-google-out-of-my-life-day-1.html\">On the other hand, people more involved than I have quit just to prove that they can</a>.</p>\n\n<p>The role Facebook Messenger played in my life is now filled by email, SMS, and 8 different chat apps. The role Facebook News Feed played was&hellip; minimal in recent months. I had been pretty annoyed at News Feed for a very long time.</p>\n\n<p>Here&rsquo;s what I had to say (on Facebook) over three years ago about the News Feed:</p>\n\n<p><img src=\"/goodbye-facebook/attachments/settings.jpg\" alt=\"News Feed Settings\" /> <span class=\"credit\">Image credit: Ratan Abraham Varghese</span></p>\n\n<blockquote><p>This Friendship Day, let Facebook decide which of your friends is most important using its cold algorithmic analysis!</p>\n\n<p>Because who cares what actually happened to your friends recently? The important thing is that you see that &ldquo;Top Story&rdquo; you already saw yesterday again!</p>\n\n<p>And guess what?</p>\n\n<p>This setting is the default! And will reset itself every few days!</p>\n\n<p>Happy friendship day, people who (Facebook decided) consider my stories &ldquo;Top&rdquo;!</p></blockquote>","attachments":[{"url":"http://www.ratan.blog/goodbye-facebook/attachments/settings.jpg","mime_type":"image/jpeg"}],"tags":["biographical","dropping tech giants","technology"],"_ratan_blog_class":""}
