{"url":"http://www.ratan.blog/j-autumn","id":"http://www.ratan.blog/j-autumn","title":"Autumn","date_modified":"2023-01-25T21:35:54-05:00","date_published":"2023-01-25T21:32:33-05:00","content_html":"<p><img src=\"/j-autumn/attachments/thumbnail.svg\" alt=\"Falling Leaves Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>I heard the drying leaves crunch underneath my boots. Every year it happened. The leaves would change their color, then fall, then dry up, and we&rsquo;d have to rake them.</p>\n\n<p>Every year it happened. It was a fact of life, a result of evolution. For the trees to survive, the leaves had to be drained of their chlorophyll and die. The parts sacrificed for the whole.</p>\n\n<p>Every year the leaves fall from the trees, but my boots would not always be able to find them. One day I would not be around to step upon the leaves. One day I would be the part.</p>\n\n<p>And who would be the whole? A family, a town, a workplace? A province, a nation? The human race? When my time came, who would have benefited from my presence?</p>\n\n<p>I thought about endings a lot these days. Every year of my life had been the same.</p>\n\n<p>The same books about evolution, and trains, and geography.</p>\n\n<p>The same friends, the same school, the same town. The same four seasons, which were the result the same latitude.</p>\n\n<p>The same country, the same culture, living under the same flag, singing the same anthem. That was my life.</p>\n\n<p>My life was ending.</p>\n\n<p>I wasn&rsquo;t dying, but I was ending. Like the leaf who went from being part of a tree to part of a compost heap. I was also changing my colors. I was also changing the whole that I was a part of.</p>\n\n<p>I knew it, logically, but never felt it was true. My mom told me months ago and I couldn&rsquo;t comprehend it. I couldn&rsquo;t believe it, until the day something different happened.</p>\n\n<p>A truck rolled up to our house, and came to a complete stop. And on the side of the truck were words I had never read before.</p>\n\n<p>&ldquo;Zachary and Co. Packers and Movers&rdquo;</p>\n\n<h3><span id=\"Notes\">Notes</span></h3>\n\n<p>This was written in 15 minutes during a Joy of Writing meetup.</p>\n\n<h3><span id=\"Feedback from the Joy of Writing Group\">Feedback from the Joy of Writing Group</span></h3>\n\n<ul>\n<li>Inconsistent viewpoint: is the narrator truly a child?</li>\n</ul>","attachments":[{"url":"http://www.ratan.blog/j-autumn/attachments/thumbnail.svg","mime_type":"image/svg+xml"}],"tags":["joy of writing","creative"],"_ratan_blog_class":"swit "}
