{"url":"http://www.ratan.blog/dumbphone","id":"http://www.ratan.blog/dumbphone","title":"Life With a Dumbphone","date_modified":"2022-01-24T01:43:58-05:00","date_published":"2017-06-04T23:59:38-04:00","content_html":"<h3>The Beginning</h3>\n\n<p>In the days leading up to my circuits exam I was gripped by illness. I fell asleep early when using my phone one day, desperate to escape a throbbing headache. I ended up waking up in the middle of the night and noticed a spark as my leg moved across the sheet.</p>\n\n<p><em>Static electricity</em></p>\n\n<p>I tried turning on my trusty Nexus 5X, and was greeted with a boot screen, which slowly but surely &hellip; disappeared and got replaced with another boot screen. My phone was stuck in a boot loop. Eventually it got hot enough to fry an egg. Or at least a smartphone-sized egg.</p>\n\n<p>Over the next few days, the Nexus would sometimes break out of its boot loop and I could use it. But the reprieve was always short-lived. Eventually the boot loop would continue, until I managed to turn off the phone or it ran out of power. I decided to keep it powered off most of the time, fearing a major overheat.</p>\n\n<p>If I wanted a new phone from my carrier I&rsquo;d have to sort out some account issues. With headaches and exams clawing at my consciousness, I was really not in the mood. So I ordered a phone online.</p>\n\n<p>It was &ldquo;new&rdquo;, but definitely not modern. It was a relic of an era long forgotten. Its buttons were many, and pixels were few.</p>\n\n<p>It was a dumbphone.</p>\n\n<h3>Into the BLU</h3>\n\n<p><img src=\"/dumbphone/attachments/dark_min.jpg\" alt=\"BLU Z3 in the dark\" /></p>\n\n<p>The <a href=\"https://www.amazon.ca/gp/product/B01AV10PJI/ref=oh_aui_detailpage_o00_s00?ie=UTF8&amp;psc=1\">BLU Z3</a> was not an impulse buy. I was very careful about choosing the right feature set for about a month of use.</p>\n\n<p>I wanted</p>\n\n<ul>\n<li>to play podcasts through a Bluetooth headset</li>\n<li>set alarms</li>\n<li>to send and receive calls and SMS</li>\n</ul>\n\n\n<p>Yeah some really modest wants. Anything else was icing on the cake that I would investigate, but not care deeply about.</p>\n\n<p>I had never heard of this BLU company, and I will likely forget about it in a few years time. I just searched for phones with SD cards and Bluetooth support and this thing popped up.</p>\n\n<p>I had to buy an SD card separately. It&rsquo;s been many years since I&rsquo;ve used one. I also bought a SIM adapter kit for my nano SIM card, which turned out to be unnecessary.</p>\n\n<h3>Starting Out</h3>\n\n<p><img src=\"/dumbphone/attachments/box_min.jpg\" alt=\"BLU Z3 box\" /></p>\n\n<p>Included in the box was a microUSB to USB cable and a USB charger. My headset also used microUSB, so I only needed to carry one cable around with me for trips.</p>\n\n<p>There was a removable battery. Pretty useful if you use the BLU Z3 for a long enough time to degrade the battery, and do not wish to spend $10 on the non-battery parts of a new BLU Z3. Of course, in this day and age, if you&rsquo;re using the BLU Z3 for that long then I pity you deeply.</p>\n\n<p><img src=\"/dumbphone/attachments/disassembled_min.jpg\" alt=\"Disassembled Z3\" /></p>\n\n<p>The plastic back of the phone could be removed easily, providing access to the SIM card and SD card slots. I had a nano SIM and the slots were normal SIM sized, but the SIM enclosure was actually tight enough to keep my card securely in place. I did not use the second SIM slot.</p>\n\n<p>Now I just had to turn the phone on. Which one of these is the power button? I was actually confused to the point of Googling the answer. Luckily, you need only click the image below to find out.</p>\n\n<p><a href=\"/dumbphone/attachments/off_circle_min.jpg\"><img src=\"/dumbphone/attachments/off_min.jpg\" alt=\"Z3 Buttons\" /></a></p>\n\n<p>After turning the phone on, I was greeted to a mess of Portugese (?) text. Luckily the Settings menu had the sort of gear and wrench iconography every other device has and I was able to convert to English in short order.</p>\n\n<h3>Bluetooth &amp; Audio</h3>\n\n<p><img src=\"/dumbphone/attachments/organizer_min.jpg\" title=\"\" alt=\"Organizer\" /></p>\n\n<p>An app separate from Settings called the &ldquo;Organizer&rdquo; is in charge of connecting to Bluetooth. The pairing usually succeeds. Only very late into using this phone did really frustrating connection failures arise. My headset has a wired mode, and the Z3 has a headphone jack, so it was not a big deal. Also, when Bluetooth is enabled, every button press is accompanied by a loud BLOOP from the speaker. I think there is a way to turn this off but I really do not know.</p>\n\n<p>In my days with the Nexus 5X, I didn&rsquo;t buy any music files. Instead I got all my music from a <a href=\"https://chrome.google.com/webstore/detail/google-play-music/icppfcnhkcmnfdhfhphakoifcfokfdhg?hl=en\">streaming service</a>. So I didn&rsquo;t have any music to put on the Z3.</p>\n\n<p>I could play podcasts though. As I was using a <a href=\"https://www.amazon.ca/gp/product/B00ZS4HK0Q/ref=oh_aui_detailpage_o01_s00?ie=UTF8&amp;psc=1\">Chromebook</a>, I would need a web-based podcast app to track my subscriptions. I used <a href=\"https://shortorange.com/\">ShortOrange</a>, which turned out to be one of the slowest, most annoying computer-related things I have ever used. With ShortOrange I would download podcast files onto the Z3 one by one. Much more tedious than using a smartphone&rsquo;s podcast app.</p>\n\n<p><img src=\"/dumbphone/attachments/music_min.jpg\" title=\"\" alt=\"Audio player\" /></p>\n\n<p>The Z3 audio player was more limited than I expected. While playing a file, the only visible metadata are the filename and the audio length. This can be a bit annoying when the people publishing the files are <a href=\"http://www.hellointernet.fm/\">notorious for inconsistent naming schemes</a>.</p>\n\n<p>Even worse was the fact that moving between different points of an audio file is impossible with the Z3. You can&rsquo;t skip an hour of a two hour podcast. This is problematic because it is very easy to jump to a new audio file: the &ldquo;play/pause&rdquo; control and &ldquo;skip entire file&rdquo; controls are different parts of the same central square button. This means a few errant keypresses <em>can send your listening back by hours</em>. Being a bit of a butterfinger myself and having bought the phone mainly for podcasts, I found this to be the most frustrating thing about the Z3.</p>\n\n<h3>Calls &amp; SMS</h3>\n\n<p>For some reason I could barely hear the people calling me. I didn&rsquo;t see that coming. A feature phone&hellip; which is bad at taking calls. It could possibly be my fault, for sticking my nano SIM card into the normal SIM slot.</p>\n\n<p>The SMS experience was poorer still. It is extremely difficult to type anything on this keypad. A word is a struggle and a sentence is agony. Since we live in the age of autocorrect, everyone <em>else</em> expects full sentence responses. I felt a bit bad replying to my extremely kindly aunt&rsquo;s paragraphs with single words and sentence fragments.</p>\n\n<p>Speaking of fragments, for some reason when receiving a long text, it is provided to the user in parts. There&rsquo;s a chime for the first chunk of characters, then a few minutes later another chime and more characters, and eventually the whole message can be read. What a nuisance.</p>\n\n<h3>Gaming</h3>\n\n<p>The games menu is buried inside the aforementioned Organizer. Makes sense, don&rsquo;t we all think of filing cabinets when gaming? There are two games available: Snake and Sokoban.</p>\n\n<p><img src=\"/dumbphone/attachments/snake_min.jpg\" alt=\"Snake\" /></p>\n\n<p>Snake is a classic. A very boring classic. Since when did snakes eat immobile balls of pixels? Maybe the problem is that I&rsquo;m stuck in easy mode and cannot escape. Snake games can be paused, but if you leave the Snake app entirely to do something else the game will not be saved. I hope I don&rsquo;t have to play for hours on end to unlock hard mode.</p>\n\n<p><img src=\"/dumbphone/attachments/sokoban_min.jpg\" alt=\"Sokoban\" /></p>\n\n<p>Sokoban is a bit interesting. I&rsquo;m pretty bad at it. The only reason I can survive the <a href=\"https://nethackwiki.com/wiki/Sokoban\">NetHack version</a> is because I memorized all the solutions. Sokoban usually saves your progress, thank goodness for that.</p>\n\n<p>All in all, these games are only worth playing if you have absolutely no alternative.</p>\n\n<h3>Random Features I Used Briefly</h3>\n\n<p>The Z3 is capable of taking photos and even video, but the resolution is comically low.</p>\n\n<p>Amazingly, there is a browser. My SIM card had internet. However my every attempt to browse the web failed. There is no WiFi of course.</p>\n\n<p>The Z3 can only have 3 alarms. I was very used to having &hellip; 30. This is another limitation I did not expect. How much space does an alarm take up? 64 bytes? What a silly restriction.</p>\n\n<h3>Random Features I Avoided</h3>\n\n<dl>\n<dt>Torch</dt>\n<dd>I clearly did not do enough spelunking.</dd>\n<dt>Ebook</dt>\n<dd>There is a folder but no other book related UI. Reading a book on this device sounds absolutely horrid.</dd>\n<dt>Calculator</dt>\n<dd>I carry another calculator that I can actually use in exams.</dd>\n<dt>Stopwatch</dt>\n<dd>I rarely use one, ever.</dd>\n<dt>PIN Code</dt>\n<dd>There&rsquo;s nothing on this phone to hide.</dd>\n<dt>Auto power on/off</dt>\n<dd>Multiple days of battery is more than enough.</dd>\n<dt>FM Radio</dt>\n<dd>This is essentially podcast and music streaming for geriatrics.</dd>\n<dt>Video Player</dt>\n<dd>On this screen?</dd>\n<dt>File System</dt>\n<dd>The user has full access and can even format the storage. This is acceptable for Linux but the Z3 is for hipsters and old people, what gives?</dd>\n</dl>\n\n<h3>In the Wild</h3>\n\n<p>One great thing about the Z3 is the battery life. When using it primarily to play audio over Bluetooth, the phone lasts for days. My headset does not have that kind of stamina, however.</p>\n\n<p>I would drop the phone now and again, and not immediately scream in horror. I would eat and smear the buttons with greasy fingers, and not quietly stew with guilt. I crossed a few borders and nobody confiscated my phone, but if someone did I would not be concerned.</p>\n\n<p>I had a transatlantic flight, and took the Z3 with me, only to realize that there was no airplane mode. The idea that someone would use this phone without wanting to call anyone probably did not cross the minds of the designers. Good thing I had <a href=\"http://www.imdb.com/title/tt3748528/\">in-flight entertainment</a> and a <a href=\"http://www.jareddiamond.org/Jared_Diamond/The_World_Until_Yesterday.html\">thick book</a>.</p>\n\n<p>At one of the security checks I left the Z3 in one of those trays for electronics, leading to this exchange with a guard.</p>\n\n<p>&ldquo;I think I left my phone here.&rdquo;</p>\n\n<p>&ldquo;What kind of phone is it?&rdquo;</p>\n\n<p>&ldquo;BLU&rdquo;</p>\n\n<p>&ldquo;I mean, what make is it? What brand?&rdquo;</p>\n\n<p>I realized that nobody would ever recognize the brand name in a million years.</p>\n\n<p>&ldquo;It&rsquo;s a dumb phone. With a lot of buttons.&rdquo;</p>\n\n<p>&ldquo;You mean like a Nokia?&rdquo;</p>\n\n<p>&ldquo;Yes&rdquo;</p>\n\n<p>And the guard handed back my phone.</p>\n\n<p>There was an occasion when I desperately needed to read an email while in an unfamiliar neighborhood. Unfortunately my Chromebook had not cached the message. I ended up wandering around for a very long while, on a quest for a free WiFi connection.</p>\n\n<p>There was also a time when I needed to walk to a far-off house. This time I checked that my Chromebook had the map cached before I left. Every so often I&rsquo;d stop walking, get my laptop from my backpack and look at the maps confused. If my laptop had been too heavy to carry with one hand, this would have been unfeasible. In retrospect &hellip; I could have used a paper map.</p>\n\n<h3>Ending the Experiment</h3>\n\n<p>On Victoria Day I  sorted out my account issues with my carrier, and the next day I got an iPhone 7 at a &ldquo;discount&rdquo;&hellip; by which I mean I will have some large phone bills for the next few months. Yes, I know that the new iPhone is probably just months away. However, anything is an upgrade from the Z3.</p>\n\n<p>The moment I saw the app grid I felt overwhelmed. Look at all these  animations and transparency and fonts and WOW I CAN SLIDE ACROSS MUSIC FILES! I used to roll my eyes at Apple describing their products as magical. But just 10 years ago, every phone game was as slow and plodding as snake, every phone font was grimly utilitarian, every color was a luxury, every pixel was precious.</p>\n\n<p>10 years ago every phone was dumb, and we should appreciate that we don&rsquo;t need to crawl back.</p>","attachments":[{"url":"http://www.ratan.blog/dumbphone/attachments/box_min.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/dumbphone/attachments/dark_min.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/dumbphone/attachments/disassembled_min.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/dumbphone/attachments/music_min.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/dumbphone/attachments/off_circle_min.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/dumbphone/attachments/off_min.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/dumbphone/attachments/organizer_min.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/dumbphone/attachments/snake_min.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/dumbphone/attachments/sokoban_min.jpg","mime_type":"image/jpeg"}],"tags":["biographical","technology"],"_ratan_blog_class":""}
