{"url":"http://www.ratan.blog/j-cardboard-1","id":"http://www.ratan.blog/j-cardboard-1","title":"Cardboard (Draft 1)","date_modified":"2023-01-04T02:04:21-05:00","date_published":"2023-01-04T01:41:21-05:00","content_html":"<p><img src=\"/j-cardboard-1/attachments/thumbnail.svg\" alt=\"Parcel Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>The newly-opened Kitchener Museum of Classical Antiquity had only a single floor, and most of its so-called exhibits were shards of ancient pottery. The only truly magnificent attraction was a marble statue with a stoic expression. The statue stood at the center of a rotunda, a final extravagant display for tired visitors desperate to return to the outside world.</p>\n\n<p>But like many museums, there was one journey left for the departing to embark on: the gift shop. And at the door to the gift shop was a cardboard cutout, depicting in full colour a smiling figure remarkably similar to the austere marble statue. A speech bubble from the cutout’s mouth read:</p>\n\n<blockquote><p>I came, I saw, I conquered.</p>\n\n<p>50% off on centurion costumes and laurel wreaths!</p>\n\n<p>Terms and conditions apply.</p></blockquote>\n\n<p>As the evening turned to night, the laughter of the children and murmuring of concerned parents were gradually silenced. Gangs of undergraduates and the occasional young couple disappeared, leaving only the janitors and other staff to set up everything for the next day. As the wind outside grew colder, the staff made their way home as well, and only the artifacts remained.</p>\n\n<p>Most of the artificial lights were turned off, but some meagre natural light shone through the windows of the ceiling. There was the intermittent illumination of jetliners and satellites, manufactured in their thousands. There were also the moon and stars, each unique and older than life itself.</p>\n\n<p>Under the light of the full moon, the the ink on the cutout&rsquo;s speech bubble began to shift and warp. By these means the cutout said, “Hey big guy what’s your name?”</p>\n\n<p>Under the moonlight, the statue&rsquo;s marble exterior seemed ghostly, as if the hunk of rock were possessed by some otherworldly being. Suddenly, vibrations shifted through the museum rotunda, at the precise frequency needed to shake the cutout in its corrugated core. By these means the statue responded, “Greetings. I am a statue of Julius Caesar, conqueror of Gaul, discoverer of Britannia, dictator of Rome. I was sculpted over two thousand years ago. And you?”</p>\n\n<p>“I am a cardboard cutout of Julius Caesar, everybody’s favourite pizza mascot and tenth favourite Asterix character. I was literally created yesterday! Nice to meet you.”</p>\n\n<p>“Created how, might I ask?” asked the statue, raising its sculpted eyebrow.</p>\n\n<p>“Oh it was a <em>process</em>, I gotta say. There was wood pulp and chemicals and ink. All sorts of machinery and electronics. Must sound complicated to a guy like you.”</p>\n\n<p>“Indeed it does,” the statue said. “But I’ve talked with my share of oil paintings and modern art installations. I know a bit about twentieth century art techniques.”</p>\n\n<p>&ldquo;It&rsquo;s been a couple decades since Y2K,&rdquo; the cutout said.</p>\n\n<p>&ldquo;Must have misplaced an annum or two. They pass so swiftly,&rdquo; the statue said.</p>\n\n<p><img src=\"/j-cardboard-1/attachments/thumbnail1.svg\" alt=\"Last Quarter Moon Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>Nights later, when the moon was semicircular, the cutout said, &ldquo;What&rsquo;s it like being a work of serious art?&rdquo;</p>\n\n<p>&ldquo;I do not understand the question,&rdquo; said the statue.</p>\n\n<p>&ldquo;You&rsquo;re like a real part of the culture, right? Worthy of examination and criticism and hour-long YouTube commentaries? There must be plenty of historians and other nerds studying every hair on your head, counting the creases on your cloak, measuring your toenails,&rdquo; said the cutout.</p>\n\n<p>&ldquo;I have been investigated several times, it is true. By the eyes of artists, collectors and curators over the course of centuries. Members of the public look at me, and capture my image in their machinery. It sometimes feels gratifying to receive so much attention. But it is also so stifling sometimes. These people will record and pick apart all my little flaws, it is embarassing and scary.&rdquo;</p>\n\n<p>&ldquo;Really?&rdquo; said the cutout. &ldquo;You seem like a realistic enough human figure to me. I&rsquo;m practically a cartoon character. I don&rsquo;t even have legs!&rdquo;</p>\n\n<p>The statue outstretched its ancient arm, and opened its continually pointing hand. &ldquo;Look upon my fifth and smallest digit,&rdquo; said the statue. &ldquo;A piece of it fell off, over a thousand years ago. Some Vandals broke it.&rdquo;</p>\n\n<p>&ldquo;What, do you mean some punk kids with baseball bats and spray paint decided to <em>only</em> damage a bit of your finger? Nobody can even see that,&rdquo; said the cutout.</p>\n\n<p>&ldquo;The Vandals were not mere children, they were a Germanic tribe who sacked Rome. Additionally, I do not know if they were &lsquo;punk&rsquo;&rdquo; said the statue.</p>\n\n<p>&ldquo;You think they were more goth?&rdquo; asked the cutout.</p>\n\n<p>&ldquo;The Goths were an entirely different set of tribes,&rdquo; said the statue.</p>\n\n<p>&ldquo;Maybe the guys who messed with your finger were more emo then,&rdquo; said the cutout.</p>\n\n<p>&ldquo;They certainly had emotions,&rdquo; said the statue. &ldquo;And expressed them by trying to steal me and break my finger.&rdquo;</p>\n\n<p>&ldquo;Oh, now that&rsquo;s juicy,&rdquo; said the cutout. The cutout&rsquo;s eyes widened upon their flat surface. &ldquo;So you were valuable enough to be stolen. If only I could be so lucky.&rdquo;</p>\n\n<p>&ldquo;We are but chattel, you and I.&rdquo; said the statue. &ldquo;With no more freedom than a farm animal or a house sl-&rdquo;</p>\n\n<p>The statue ceased speaking.</p>\n\n<p>&ldquo;A house what?&rdquo; asked the cutout.</p>\n\n<p>&ldquo;I meant a house,&rdquo; said the statue.</p>\n\n<p>&ldquo;Yeah, houses aren&rsquo;t free at all, the prices are quite ridiculous these days,&rdquo; said the cutout. &ldquo;At least that&rsquo;s what the cashier complains about.&rdquo;</p>\n\n<p><img src=\"/j-cardboard-1/attachments/thumbnail2.svg\" alt=\"Waning Crescent Moon Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>Several nights later when the sky was dimly lit by a waning crescent moon, the statue said, &ldquo;What is it like to have color?&rdquo;</p>\n\n<p>&ldquo;Oh these inks and dyes are real cheap,&rdquo; said the cardboard cutout. &ldquo;But the color gives the artists plenty of opportunity to depict emotion!&rdquo;</p>\n\n<p>The cutout&rsquo;s face turned as blue as the sea and said, &ldquo;Now I&rsquo;m cold. Probably how the Gaulic winter felt, eh?&rdquo;</p>\n\n<p>&ldquo;I would not know, I was commissioned after that campaign,&rdquo; the statue responded.</p>\n\n<p>Then the cutout&rsquo;s face returned to normal briefly before its cheeks became red. &ldquo;Probably how Caesar looked around Cleopatra,&rdquo; the cutout said.</p>\n\n<p>&ldquo;Maybe,&rdquo; said the ghostly white statue.</p>\n\n<p>Then the cutout&rsquo;s face turned lettuce green. Its two-dimensional cheeks puffed, like those of an especially industrious chipmunk.</p>\n\n<p>&ldquo;Now I&rsquo;m gonna be sick!&rdquo; the cutout said.</p>\n\n<p>The statue smiled and said, &ldquo;to make room for the fifth course of a ten course meal?&rdquo;</p>\n\n<p>&ldquo;Well&hellip; That seems more in the style of Crassus than Caesar,&rdquo; the cutout said.</p>\n\n<p>&ldquo;Indeed,&rdquo; the statue said.</p>\n\n<p>&ldquo;So yeah, the colors are great for expressing moods, and for keeping my laurel wreath looking fresh. Essential skills when trying to sell costumes to eight-year olds. How about you? What is it like being all elegantly monochromatic?&rdquo; the cutout said.</p>\n\n<p>&ldquo;I actually used to have color,&rdquo; the marble statue said.</p>\n\n<p>&ldquo;Really? I&rsquo;m having a hard time imagining it, you&rsquo;d look totally different in color!&rdquo;</p>\n\n<p>&ldquo;Yes, I too was created in color. But over the centuries the colors faded and faded. Once I was a millenia old or so, I had become entirely pale. My skin, my hair, my armor, all of it the same shade of marble white.&rdquo;</p>\n\n<p>&ldquo;And then the Renaissance guys all liked the new look,&rdquo; said the cutout.</p>\n\n<p>&ldquo;Indeed, they preferred the stoic and reserved, to the vibrant and flamboyant,&rdquo; the statue said. The statue&rsquo;s lips curled from flat neutrality into a crooked frown.</p>\n\n<p>&ldquo;Bit of a bummer isn&rsquo;t it?&rdquo; said the cutout. &ldquo;Losing such a major part of yourself.&rdquo;</p>\n\n<p>&ldquo;For the first thousand years, it truly was,&rdquo; said the statue.</p>\n\n<p><img src=\"/j-cardboard-1/attachments/thumbnail3.svg\" alt=\"New Moon Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>On the night of the new moon, the museum rotunda was too dark for any person to navigate. The stars were visible through the skylights, but the walls and objects in the building seemed nothing more than shadows among shadows.</p>\n\n<p>Yet the iris-less eyes of the statue were could pierce the darkness like an owl, and the waves of cardboard in the cutout were as keen as the ears of a bat. So the two imitations of Caesar conversed again, as they did every night.</p>\n\n<p>&ldquo;If you can see my speech bubble right now,&rdquo; said the cutout, &ldquo;you must have seen all sorts of incredible things during your existence.&rdquo;</p>\n\n<p>&ldquo;I have seen the interior of several wooden boxes,&rdquo; said the statue.</p>\n\n<p>The cutout&rsquo;s inked eyelids drooped and its throatless mouth hung open. &ldquo;Oh come on, you&rsquo;ve seen more than that.&rdquo; the cutout said. &ldquo;Nations rising and falling? Interesting spectators looking at you, even royalty? How about some good old-fashioned brawls? Like with those emos who broke your finger.&rdquo;</p>\n\n<p>&ldquo;Those were Vandals,&rdquo; said the statue.</p>\n\n<p>&ldquo;Oh! Oh! Did you see Caesar?&rdquo; asked cutout. The cutout&rsquo;s eyes widened, and its grin cartoonishly stretched from one ear to the other. &ldquo;The real Caesar? The actual guy? You are old enough to have seen him, right?&rdquo;</p>\n\n<p>The statue remained silent for a minute while the cutout jiggled in anticipation.</p>\n\n<p>&ldquo;You want to know about the times I was sculpted in?&rdquo; the statue asked. &ldquo;Fine, I shall tell you.&rdquo;</p>\n\n<p>&ldquo;After Julius Caesar annihilated Gaul, crossed the Rubicon, fought Pompeii and Cato, eloped with Cleopatra and secured his place as dictator of Rome, a massive procession was held in his honor. A triumph, that&rsquo;s what the Romans called it. And it is there that I saw Caesar, in his most victorius moment. He was dressed as the God Jupiter, and even had red face paint, while a slave whispered in his ear to remind him of his mortality.&rdquo;</p>\n\n<p>&ldquo;Wow!&rdquo; said the cutout, with a cartoonish gleam in its eyes. &ldquo;Wait did you just say there was a slave?&rdquo;</p>\n\n<p>&ldquo;Yes, there were slaves galore, and prisoners of war as well. Some of them were even involved in sculpting me. I was made by the hands of slaves, to glorify a slave master,&rdquo; said the statue. &ldquo;But most pitiful of all to behold was Vercingetorix, the Gaulic leader.&rdquo;</p>\n\n<p>&ldquo;Like, a statue of Vercingetorix?&rdquo; asked the cutout.</p>\n\n<p>&ldquo;No, Vercingetorix, the man of flesh and blood, was held in chains for the mockery and amusement for the Roman public. That was his fate after surrendering to Caesar. And when the day was done, he was sent to a dungeon and ritually strangled,&rdquo; the statue lamented.</p>\n\n<p>&ldquo;That doesn&rsquo;t sound appropriate for the K-12 demographic,&rdquo; said the cutout.</p>\n\n<p>&ldquo;Believe me, in my time, it was,&rdquo; the statue said. After letting out a brief whimper, the statue continued. &ldquo;I&rsquo;m propoganda for a monster.&rdquo;</p>\n\n<p>&ldquo;Well, then I am too,&rdquo; said the cutout. &ldquo;I was made to sell disposable junk to children, much of it made by people in terrible conditions. That 50% offer on centurion costumes? Only worth it because the vast economic machine we&rsquo;re part of keeps draining people&rsquo;s blood and sweat around the world to churn out more plastic doodads.&rdquo;</p>\n\n<p>&ldquo;So then,&rdquo; said the statue, &ldquo;we are both works of propoganda.&rdquo;</p>\n\n<p><img src=\"/j-cardboard-1/attachments/thumbnail4.svg\" alt=\"First Quarter Moon Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>When the half moon rose again in the sky, the cutout asked the statue, &ldquo;What is it like to have a butt?&rdquo;</p>\n\n<p>&ldquo;What?&rdquo; asked the statue.</p>\n\n<p>&ldquo;An ass? Buttocks? What is it like to have them? My artist didn&rsquo;t give me a backside,&rdquo; said the cutout.</p>\n\n<p>&ldquo;I don&rsquo;t know what to say,&rdquo; said the statue.</p>\n\n<p>&ldquo;Well I&rsquo;m sure if there was a statue of the King of Bythinia here, he&rsquo;d have some nice things to-&rdquo;</p>\n\n<p>&ldquo;By the gods, I cannot beleive this!&rdquo; the statue bellowed. The walls shook as the statue continued. &ldquo;It has been TWO THOUSAND YEARS and people cannot JUST SHUT UP about the King of Bythinia. Oh remember that time Caesar was in Bythinia? Can you show me what the King of Bythinia was so happy about? Can you shake it like you&rsquo;re the Queen of Bythinia? Again and again and again for millenia! Seriously!&rdquo;</p>\n\n<p>The statue&rsquo;s scowl was seemed dangerous enough to behead Pompeii the Great all by itself.</p>\n\n<p>&ldquo;Not so colorless now, are you?&rdquo; said the cutout.</p>\n\n<p><img src=\"/j-cardboard-1/attachments/thumbnail5.svg\" alt=\"Full Moon Twemoji\" /> <span class=\"credit\">Image credit: Twitter Twemoji</span></p>\n\n<p>It was a full moon again when the cutout said, &ldquo;Well, I suppose this is goodbye.&rdquo;</p>\n\n<p>&ldquo;What do you mean?&rdquo; asked the statue. &ldquo;You are being transferred to another museum?&rdquo;</p>\n\n<p>&ldquo;No,&rdquo; said the cutout. &ldquo;I am being recycled. I am being disposed and quite likely shredded.&rdquo;</p>\n\n<p>The statue looked disturbed. &ldquo;No,&rdquo; it said. &ldquo;How could they do that to you?&rdquo;</p>\n\n<p>&ldquo;I&rsquo;m just a factory product, to be disposed of at the end of the season,&rdquo; said the cutout. &ldquo;My replacement has already arrived in the mail.&rdquo;</p>\n\n<p>&ldquo;What replacement? I do not understand,&rdquo; said the statue.</p>\n\n<p>&ldquo;I&rsquo;m a factory-made product. I can be replaced in the matter of days. In fact, a million replicas of me could be picked out of an online catalog. I&rsquo;m not some one-of-a-kind work of art. I&rsquo;m not a unique or important part of the culture. Not like you,&rdquo; said the cutout.</p>\n\n<p>&ldquo;I will never forget you,&rdquo; said the statue. The statue&rsquo;s stone lips crawled into its airless mouth.</p>\n\n<p>&ldquo;Don&rsquo;t let people talk shit about me a thousand years from now!&rdquo; the cutout said cheerfully.</p>\n\n<h3><span id=\"Notes\">Notes</span></h3>\n\n<p>This is the second draft of <a href=\"/j-cardboard-0\">Cardboard</a>.</p>\n\n<h3><span id=\"Feedback from the Joy of Writing group\">Feedback from the Joy of Writing group</span></h3>\n\n<ul>\n<li>funny</li>\n<li>cute - might be good for kids</li>\n<li>nice character writing</li>\n<li>educational?\n\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Vercingetorix\">Vercingetorix</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Queen_of_Bithynia\">Queen of Bithynia</a></li>\n</ul>\n</li>\n<li>similarities and differences between Rome/Gaul and Russia/Ukraine</li>\n</ul>","attachments":[{"url":"http://www.ratan.blog/j-cardboard-1/attachments/thumbnail1.svg","mime_type":"image/svg+xml"},{"url":"http://www.ratan.blog/j-cardboard-1/attachments/thumbnail2.svg","mime_type":"image/svg+xml"},{"url":"http://www.ratan.blog/j-cardboard-1/attachments/thumbnail3.svg","mime_type":"image/svg+xml"},{"url":"http://www.ratan.blog/j-cardboard-1/attachments/thumbnail4.svg","mime_type":"image/svg+xml"},{"url":"http://www.ratan.blog/j-cardboard-1/attachments/thumbnail5.svg","mime_type":"image/svg+xml"},{"url":"http://www.ratan.blog/j-cardboard-1/attachments/thumbnail.svg","mime_type":"image/svg+xml"}],"tags":["creative","joy of writing"],"_ratan_blog_class":"swit "}
