{"url":"http://www.ratan.blog/blog-enhancements","id":"http://www.ratan.blog/blog-enhancements","title":"Enhancements to This Blog","date_modified":"2023-01-02T21:49:46-05:00","date_published":"2018-09-06T19:49:58-04:00","content_html":"<h3><span id=\"Introduction\">Introduction</span></h3>\n\n<p>When this blog began, it was pretty much for my own amusement. I\npicked technologies specifically because they seemed fun to play\nwith. Features were limited based on how easy I thought they would be\nto implement myself. The layout was optimized not for reading experience, but for showing off SVG resizing and CSS transparency. I\nstarted writing prose, but switched to listicles and even bullet\npoints simply because it was easy.</p>\n\n<p>Was this all good? Bad? I had no idea. My own opinion reversed itself\nevery few days. As for other people, their feedback was limited to\ndirect messages and a log file that nobody read.</p>\n\n<p>All the while, the wider internet was changing. So over the past few\nweeks, I decided to enhance this site on several fronts.</p>\n\n<h3><span id=\"Server-Side Changes You Hopefully Will Not Notice\">Server-Side Changes You Hopefully Will Not Notice</span></h3>\n\n<p>The first change was an overhaul of the content management system. The incumbent was a system I wrote myself in Golang:\n<a href=\"https://github.com/ratanvarghese/blom\"><code>blom</code></a>. Golang is a fun\nlittle language for certain tasks, but its unique strengths did\nnot shine through in <code>blom</code>.</p>\n\n<p>I pretty much rewrote <code>blom</code> such that each task was conducted\nusing the most suitable language: file management was handled in bash\nscripts, templating was handled using\n<a href=\"https://www.gnu.org/software/m4/m4.html\">m4</a> and various other tools\nwere used as appropriate. This is obviously not something a reader\nwould notice directly, but it made adding new features and testing new layouts significantly easier.</p>\n\n<p>Another enabling change was switching from a <a href=\"https://www.npmjs.com/package/http-server\">simple NodeJS-based server</a> to\n<a href=\"https://nginx.org/en/\">nginx</a>. In retrospect this was not necessary,\nbut it made some of the next changes easier to configure.</p>\n\n<p>In the past, every time a file on this site was accessed, a line\nwould be added to a log file which I never, ever checked. However,\nnow I&rsquo;ve installed a <a href=\"https://goaccess.io/\">web log analyzer</a> which\npresents all the data with pretty colors. I used to feel like I was\nshouting into the void, but now when I write I can be assured that\nplenty of search engine bots are reading.</p>\n\n<h3><span id=\"HTTPS\">HTTPS</span></h3>\n\n<p>Even before this blog existed, the world has been moving to using\n<a href=\"https://security.googleblog.com/2016/09/moving-towards-more-secure-web.html\">HTTPS by default for all websites</a>. <code>ratan.blog</code> has been very late to the party &hellip; still, better late than never!</p>\n\n<h3><span id=\"Comments\">Comments</span></h3>\n\n<p>I added a comment system! That <a href=\"/adding-comments\">merits its own article</a>.</p>\n\n<h3><span id=\"Styling\">Styling</span></h3>\n\n<p><a href=\"/blog-enhancements/attachments/old.html\">Here</a> is what the blog used to look like.</p>\n\n<p>I actually attempted <a href=\"https://meyerweb.com/eric/tools/css/reset/\">disable all the browser&rsquo;s default styling</a> and individually\nwrite new styles for every possible HTML element. This was both\nexhausting and probably a waste of time, but reading the\n<a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element\">MDN list of HTML elements</a> was very educational. For one thing, I finally know\nwhat a description list is (also called a definition list). As for\nthe CSS reset, I ended up just using the budget version:</p>\n\n<pre><code>* {\nmargin:0;\npadding:0;\n}\n</code></pre>\n\n<p>After eliminating the Lufthansa-esque color scheme, the next casualty\nwas the logo.</p>\n\n<p><img src=\"/blog-enhancements/attachments/calculated_asymmetry.svg\" alt=\"old logo\" /> <span class=\"credit\">Image credit: Ratan Abraham Varghese</span></p>\n\n<p>What was the point of that logo? Was it totally arbitrary? Well, I\ndon&rsquo;t actually remember. All I know is, the filename was\n<code>calculated_asymmetry.svg</code>, but the logo was symmetrical using an axis\n45&deg; from the horizontal. What a scandal!</p>\n\n<p><img src=\"/blog-enhancements/attachments/calculated_asymmetry_new.svg\" alt=\"new logo\" /> <span class=\"credit\">Image credit: Ratan Abraham Varghese</span></p>\n\n<p>The meaning of the new logo is that right-angled trapezoids are\nunderrated.</p>\n\n<h3><span id=\"Short URLs\">Short URLs</span></h3>\n\n<p>So you know that feeling when some task seems so easy that there\nwould be no reason to test it, but then something goes wrong that\ncould have been easily detected while testing? Yeah,\nthat&rsquo;s what happened after I registered <a href=\"http://r3n.me\">r3n.me</a>. I tried to\nmake a script that created alternate URLs for every existing article.\nUnfortunately it created alternate URLs for those alternate URLs\nevery time it was run. Eventually there were 3 or 4 paths to every\narticle and each path had a corresponding entry in the RSS, Atom and\nJSON Feeds.</p>\n\n<p>If you were subscribed to any of those feeds and saw &ldquo;re-runs&rdquo; of old\narticles, sorry about that.</p>\n\n<p>On the plus side, there are short URLs for every article. They are\nrecorded in the <a href=\"/archive\">archive</a>.</p>\n\n<h3><span id=\"Content\">Content</span></h3>\n\n<p>The third item will shock you!</p>\n\n<dl>\n<dt>Description lists</dt>\n<dd>I edited a previous article to use a description list, because description lists are cool and underrated (much like right-angled trapezoids).</dd>\n<dt>Listicles</dt>\n<dd>I haven&rsquo;t removed the old listicles, but will probably not write more.</dd>\n<dt>More Frequent Updates</dt>\n<dd>Just kidding.</dd>\n</dl>","attachments":[{"url":"http://www.ratan.blog/blog-enhancements/attachments/calculated_asymmetry_new.svg","mime_type":"image/svg+xml"},{"url":"http://www.ratan.blog/blog-enhancements/attachments/calculated_asymmetry.svg","mime_type":"image/svg+xml"},{"url":"http://www.ratan.blog/blog-enhancements/attachments/old.html","mime_type":"text/html"},{"url":"http://www.ratan.blog/blog-enhancements/attachments/style.css","mime_type":"text/plain"}],"tags":["meta","technology"],"_ratan_blog_class":""}
