{"url":"http://www.ratan.blog/z-bird","id":"http://www.ratan.blog/z-bird","title":"Bird Maze","date_modified":"2023-01-02T23:05:45-05:00","date_published":"2022-12-31T06:44:49-05:00","content_html":"<p>For the first time in many years, I have finished drawing a maze. The full-size maze image is available <a href=\"/z-bird/attachments/bird.jpg\">here</a>, a compressed version is below.</p>\n\n<p><img src=\"/z-bird/attachments/bird.webp\" alt=\"Bird maze\" /> <span class=\"credit\">Image credit: Ratan Abraham Varghese</span></p>\n\n<p>The start (S) is at the tip of the beak, and the finish (F) is on the big toe. Yes, this maze <em>does</em> have a solution. But I&rsquo;ll be keeping that to myself.</p>\n\n<h3><span id=\"Behind the Screen\">Behind the Screen</span></h3>\n\n<p>This maze is based on a sad and gruesome photo I took a long time ago. I was walking around the University of Waterloo dorms and looked down to see a tiny dead bird, smaller even than my toe. It was featherless, suggesting that it might have been a baby bird too young to fend for itself. The avian remains were tragic, gross but also deeply fascinating so I photographed them. Instead of burying the creature, I just went ahead with my walk as if nothing had happened. When I returned hours later, the dead bird was gone - the photo was all I had. The photo of the actual bird corpse is <a href=\"/z-bird/attachments/irl.webp\">here</a> if you dare to look at it.</p>\n\n<p>Probably the toughest part of drawing the maze was right at the beginning, when I was trying to scale up all the features of the tiny real bird to fill my page. I&rsquo;m not a professional artist, only an amateur and as such I am terrible at drawing things with the correct proportions. To work around this weakness, I took thirty-eight measurements of the photo on my phone screen before sketching out the bird&rsquo;s body. Hopefully, now that I am out of University, I can spend some time learning to draw objects proportionally before starting my next maze.</p>\n\n<p>The actual process of filling the image with maze paths was relatively easy. It requires very little skill, but a lot of patience. The only reason this maze took so long was that it was a low priority task. The whole thing could have easily been done in a month or less if it were my full time job.</p>\n\n<p>That said, I did make several mistakes, partly due to inattention, and partly due to pausing work on the maze for months or years at a time. On the bird&rsquo;s head, the area that would have been the bird&rsquo;s eyes (if the bird ever had eyes) was drawn in two colors, simply because I picked the wrong pen one day. The background gravel ended up being two colors for a similar reason. The gravel design was initially supposed to have more blank circles and fewer twisty paths. Finally the direction of lines on the bird&rsquo;s leg joints was intended to be vertical instead of horizontal. Perhaps all these minor issues could have been avoided by writing down a style guide at the start, and committing to it: I could not remember all these little plans over the course of weeks, let alone years.</p>\n\n<h3><span id=\"Kaleidoscope\">Kaleidoscope</span></h3>\n\n<p>Much like one of my older mazes from high school, I tried turning this one into a fractal pattern that I could use as a desktop background. In high school I used the Kaleidoscope filter in an application named Core Image Fun House: that application was Mac-specific and also, <a href=\"https://stackoverflow.com/questions/10939346/where-can-i-find-core-image-fun-house-app\">is no longer supported</a>. But the same effect is available in GIMP, and also called Kaleidoscope. Once again, the full-size kaleidoscope image is available <a href=\"/z-bird/attachments/kaleidoscope.jpg\">here</a>, and a compressed version is below.</p>\n\n<p><img src=\"/z-bird/attachments/kaleidoscope.webp\" alt=\"Bird kaleidoscope\" /> <span class=\"credit\">Image credit: Ratan Abraham Varghese</span></p>","attachments":[{"url":"http://www.ratan.blog/z-bird/attachments/bird_head.webp","mime_type":"image/webp"},{"url":"http://www.ratan.blog/z-bird/attachments/bird.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/z-bird/attachments/bird.webp","mime_type":"image/webp"},{"url":"http://www.ratan.blog/z-bird/attachments/irl.webp","mime_type":"image/webp"},{"url":"http://www.ratan.blog/z-bird/attachments/kaleidoscope_center.webp","mime_type":"image/webp"},{"url":"http://www.ratan.blog/z-bird/attachments/kaleidoscope.jpg","mime_type":"image/jpeg"},{"url":"http://www.ratan.blog/z-bird/attachments/kaleidoscope.webp","mime_type":"image/webp"}],"tags":["creative","maze"],"_ratan_blog_class":""}
